#@ # 
#@ # Running lm_shell Version V-2023.12 for linux64 -- Nov 23, 2023
#@ # Date:   Wed May 15 20:12:43 2024
#@ # Run by: vlsi@v23010007
#@ 

start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
create_workspace -flow exploration -technology /eda/synopsys/project/standardCell/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Digital_Standard_cell_Library/process/astro/tech/astroTechFile.tf ndmTest
set_app_options -list {lib.workspace.save_layout_views {true}}
set_app_options -list {design.enable_lib_cell_editing {mutable}}
set_app_options -list {lib.workspace.keep_all_physical_cells {true}}
set_app_options -list {lib.workspace.save_design_views {true}}
read_db { /eda/synopsys/project/standardCell/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Digital_Standard_cell_Library/synopsys/models/saed90nm_max_lth.db }
read_lef /eda/synopsys/project/standardCell/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Digital_Standard_cell_Library/lef/saed90nmEditted.lef
change_selection [get_workspaces {ndmTest}]
group_libs
process_workspaces  -directory /eda/synopsys/final_project/ndm
change_selection [get_workspaces {ndmTest}]
