 
                              IC Compiler II (TM)

                  Version V-2023.12 for linux64 - Nov 23, 2023
  This release has significant feature enhancements. Please review the Release
                       Notes associated with this release.

                    Copyright (c) 1988 - 2023 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)

Error: This script has expired. Please contact Aditya/Amir/Wei-Chih.
icc2_shell> start_gui
icc2_shell> open_block /eda/synopsys/final_project/pnr/counter.dlib:CTS1.design
Information: User units loaded from library 'saed90nm_max_lth' (LNK-040)
Opening block 'counter.dlib:CTS1.design' in edit mode
icc2_shell> link_block
Using libraries: counter.dlib saed90nm_max_lth
Visiting block counter.dlib:CTS1.design
Design 'i2c_master_top' was successfully linked.
1
icc2_shell> gui_show_man_page gui
icc2_shell> gui_set_setting -windo [gui_get_current_window -types Layout -mru] -setting -value "CLOCK_TREES"
Error: extra positional option 'CLOCK_TREES' (CMD-012)
Error: Required argument '-value' was not found (CMD-007)
icc2_shell> gui_create_clock_graph
Error: Required argument '-clct' was not found (CMD-007)
icc2_shell> gui_create_clock_graph -clct
Error: value not specified for option '-clct' (CMD-008)
icc2_shell> gui_create_clock_graph -clct $clock_paths -levelized
Error: can't read "clock_paths": no such variable
        Use error_info for more info. (CMD-013)
icc2_shell> gui_get_display_view -cells A
Warning: Nothing implicitly matched 'A' (SEL-003)
Error: Nothing matched for -cells (SEL-005)
icc2_shell> gui_get_display_view -cells
Error: value not specified for option '-cells' (CMD-008)
icc2_shell> gui_set_display_view(2)
Error: unknown command 'gui_set_display_view(2)' (CMD-005)
icc2_shell> set top [gui_create_window -type TopLevel]
TopLevel.1
icc2_shell> set layout [gui_create_window -type Layout -parent $top]
Layout.2
icc2_shell> gui_show_window -window $layout -show_state {maximized}
1
icc2_shell> gui_show_window -window $layout -show_state {normal}
1
icc2_shell> 
Error: Unknown attribute 'CellArea'. (FLT-005)
Error: while parsing filter expression: 
        at '  CellArea =~ "" 
            ^' (FLT-003)
icc2_shell> change_selection [get_cells -design [current_block] -physical_context -filter {ref_name=="XNOR2X1"}]
icc2_shell> change_selection [get_cells -design [current_block] -physical_context -filter {ref_name=="OR4X1"}]
icc2_shell> change_selection [get_cells -design [current_block] -physical_context -filter {ref_name=="OR3X1"}]
icc2_shell> 
Information: Timing analysis of the clock trunk has been disabled.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Information: Timer using 1 threads
Information: Corner default: no PVT mismatches. (PVT-032)
Information: Timing analysis of the clock trunk has been disabled.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CreateTrackTool
icc2_shell> gui_set_mouse_tool_option -tool CreateTrackTool -option {step} -value {0.32}
icc2_shell> 
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{54.930 106.450} {103.085 57.000}} -scale 0.2589
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {223.370 70.030} -scale 0.2521
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {223.370 70.030} -scale 0.2521
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {223.370 70.030} -scale 0.2521
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> 
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {158.820 77.595} -scale 0.2521
Warning: One of the edited objects is outside of design boundary. (LED-023)
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {122.260 64.985} -scale 0.2521
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {228.665 79.105} -scale 0.2521
Warning: One of the edited objects is outside of design boundary. (LED-023)
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> 
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> 
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
icc2_shell> undo
1
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-0.275 69.775} -scale 0.2521
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CreateTrackTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-33.810 113.395} -scale 0.2521
Warning: One of the edited objects is outside of design boundary. (LED-023)
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {69.820 46.330} -scale 0.2521
icc2_shell> man set_v
Error: ambiguous command 'set_v' matched 16 commands:
        (set_variation, set_vclp_options, set_via_def ...) (CMD-006)
Error: No manual entry for 'set_v' (CMD-025)
icc2_shell> man set
set(n)                       Tcl Built-In Commands                      set(n)

NAME
       set - Read and write variables

SYNOPSIS
       set varName ?value?

DESCRIPTION
       Returns the value of variable varName.  If value is specified, then set
       the value of varName to value, creating a new variable if one does  not
       already  exist,  and  return  its  value.   If varName contains an open
       parenthesis and ends with a close parenthesis, then  it  refers  to  an
       array  element:   the  characters before the first open parenthesis are
       the name of the array, and the characters between the  parentheses  are
       the index within the array.  Otherwise varName refers to a scalar vari-
       able.

       If varName includes namespace qualifiers  (in  the  array  name  if  it
       refers  to  an  array  element), or if varName is unqualified (does not
       include the names of any containing namespaces)  but  no  procedure  is
       active,  varName  refers  to a namespace variable resolved according to
       the rules described under NAME RESOLUTION in the namespace manual page.

       If  a  procedure  is  active  and  varName is unqualified, then varName
       refers to a parameter or local variable of the procedure,  unless  var-
       Name  was  declared  to  resolve differently through one of the global,
       variable or upvar commands.

EXAMPLES
       Store a random number in the variable r:

       set r [expr {rand()}]

       Store a short message in an array element:

       set anAry(msg) "Hello, World!"

       Store a short message in an array element specified by a variable:

       set elemName "msg" set anAry($elemName) "Hello, World!"

       Copy a value into the variable out from a variable whose name is stored
       in  the  vbl  (note  that  it is often easier to use arrays in practice
       instead of doing double-dereferencing):

       set in0 "small random" set in1 "large random" set vbl  in[expr  {rand()
       >= 0.5}] set out [set $vbl]

SEE ALSO
       expr(n),   global(n),   namespace(n),   proc(n),   trace(n),  unset(n),
       upvar(n), variable(n)

KEYWORDS
       read, write, variable

Tcl                                                                     set(n)
icc2_shell> start_gui
icc2_shell> gui_show_man_page set
icc2_shell> 
Warning: gui_select_annotation_shapes_of_selected matched no objects, the selection was not changed.
icc2_shell> gui_set_select_related_push_selection -value 0
icc2_shell> gui_set_select_related_push_selection -value 1
icc2_shell> 
Warning: Found no macros in the selected cells, the selection was not changed. (GUI-998)
Warning: gui_select_pseudo_tsv_defs_of_selected matched no objects, the selection was not changed.
Warning: gui_select_bump_patterns_of_selected matched no objects, the selection was not changed.
Warning: gui_select_bump_regions_of_selected matched no objects, the selection was not changed.
Warning: gui_select_rtl_statements_of_selected matched no objects, the selection was not changed.
Warning: gui_select_annotation_shapes_of_selected matched no objects, the selection was not changed.
Warning: gui_select_pseudo_bumps_of_selected matched no objects, the selection was not changed.
icc2_shell> open_block /eda/synopsys/final_project/pnr/counter.dlib:placement.design
Information: The command 'open_block' cleared the undo history. (UNDO-016)
Opening block 'counter.dlib:placement.design' in edit mode
icc2_shell> 
Using libraries: counter.dlib saed90nm_max_lth
Visiting block counter.dlib:placement.design
Design 'i2c_master_top' was successfully linked.
Warning: gui_select_connections_of_selected matched no objects, the selection was not changed.
icc2_shell> gui_set_select_related_push_selection -value 0
icc2_shell> 
Warning: Found no macros in the current block, the selection was not changed. (GUI-998)
Warning: Found no macros in the current block, the selection was not changed. (GUI-998)
icc2_shell> set_working_design_stack counter.dlib:CTS1.design
icc2_shell> set_edit_setting -select_partial_object {true}
icc2_shell> set_edit_setting -select_partial_object {false}
icc2_shell> change_selection [get_cells -design [current_block] -physical_context -filter {ref_name=="OR2X1"}]
icc2_shell> change_selection [get_cells -design [current_block] -physical_context -filter {ref_name=="OR2X1"}]
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CreateCellTool
icc2_shell> gui_set_mouse_tool_option -tool CreateCellTool -option {designType} -value {module}
icc2_shell> 
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {91.160 73.835} -scale 0.1176
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {99.800 87.965} -scale 0.0147
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {101.535 88.745} -scale 0.0147
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {102.590 88.015} -scale 0.0147
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {142.125 67.950} -scale 0.2423
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> gui_change_highlight -remove -all_colors
icc2_shell> gui_set_highlight_options -current_color yellow
icc2_shell> gui_change_highlight -remove -all_colors
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CreateCellTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start AreaPushTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-2.685 120.760} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-1.165 119.620} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-1.165 119.430} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-1.165 119.430} {-18.440 125.125}} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-11.035 123.610} {-2.115 95.515}} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-1.165 109.565} {-2.875 109.940}} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-2.875 109.940} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-32.675 135.565} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start AreaPushTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start AreaPushTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start QuickConnectTool
icc2_shell> gui_set_mouse_tool_option -tool QuickConnectTool -option {HorizontalWidth} -value {0.14}
icc2_shell> gui_set_mouse_tool_option -tool QuickConnectTool -option {VerticalWidth} -value {0.16}
icc2_shell> 
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start QuickConnectTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start ReshapeTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-1.355 100.830} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {7.185 110.130} -scale 0.1898 -modifiers { Control}
icc2_shell> gui_set_mouse_tool_option -tool ReshapeTool -option {mode} -value {Add}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {1.680 112.410} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {1.680 112.980} -scale 0.1898
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_set_mouse_tool_option -tool ReshapeTool -option {mode} -value {Cut}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-1.165 110.320} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {3.955 106.525} -scale 0.1898
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-1.840 115.275} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {2.170 108.395} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {2.170 108.395} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {2.170 108.970} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {2.170 109.160} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {0.255 115.275} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {0.255 115.275} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {0.255 115.275} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-20.185 107.060} {57.390 71.515}} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {8.665 108.970} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {8.665 108.970} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {8.665 108.970} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-1.270 132.090} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-1.270 132.090} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{11.340 116.040} {-17.510 124.065}} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-0.315 111.455} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {11.340 109.925} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {16.500 107.630} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {17.645 109.735} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {24.145 111.455} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {25.865 109.350} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {26.435 109.350} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {26.435 109.350} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{22.805 109.925} {32.550 110.500}} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{32.550 110.115} {31.020 106.865}} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {31.020 108.970} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {31.020 108.970} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{31.020 108.970} {13.825 118.140}} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{12.485 126.740} {215.800 -24.215}} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {0.255 129.415} -scale 0.1911 -modifiers { Control}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {6.945 133.620} -scale 0.1911 -modifiers { Control}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {8.285 137.630} -scale 0.1911 -modifiers { Control}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {12.870 130.180} -scale 0.1911 -modifiers { Control}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {20.510 129.990} -scale 0.1911 -modifiers { Control}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {27.585 129.990} -scale 0.1911 -modifiers { Control}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {18.410 126.930} -scale 0.1911 -modifiers { Control}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {17.455 129.795} -scale 0.1911 -modifiers { Control}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {19.555 127.505} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-16.555 88.715} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start StretchConnectedTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start ReshapeTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-4.135 138.395} {166.310 -2.625}} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {12.485 128.075} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {14.970 114.510} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{8.090 135.340} {82.425 42.470}} -scale 0.1911
icc2_shell> set_snap_setting -enabled {false}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{43.825 129.415} {75.735 94.255}} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {53.760 126.740} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {53.760 126.740} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {56.820 121.390} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CreateCellTool
icc2_shell> gui_set_mouse_tool_option -tool CreateCellTool -option {createState} -value {1}
icc2_shell> gui_set_mouse_tool_option -tool CreateCellTool -option {lib} -value {saed90nm_max_lth}
icc2_shell> gui_set_mouse_tool_option -tool CreateCellTool -option {refBlk} -value {DFFARX1}
icc2_shell> gui_set_mouse_tool_option -tool CreateCellTool -option {name} -value {DFFARX1_0}
icc2_shell> 
icc2_shell> 
icc2_shell> 
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
icc2_shell> remove_physical_objects
icc2_shell> remove_physical_objects
icc2_shell> remove_physical_objects
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CreateCellTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-25.920 109.735} -scale 0.1911
icc2_shell> gui_set_mouse_tool_option -tool CreateCellTool -option {name} -value {DFFARX1_1}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start DeleteTool
icc2_shell> gui_set_mouse_tool_option -tool DeleteTool -option {removeDisconnected} -value false
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-25.535 110.880} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {10.765 139.735} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {12.485 133.810} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {20.705 135.340} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {27.200 135.340} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {29.300 134.765} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {40.385 129.415} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {40.385 129.415} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {45.925 125.975} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {46.310 125.975} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {40.720 123.970} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {40.720 123.970} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.535 123.685} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.535 123.685} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.725 123.685} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.725 123.685} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.725 123.685} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.725 123.685} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.725 123.685} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.485 122.630} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.440 122.630} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {41.675 122.825} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {41.675 122.825} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {41.675 122.965} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{41.915 123.395} {42.010 123.825}} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {42.055 124.255} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {41.815 125.690} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {41.815 125.735} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {41.720 125.735} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{41.720 125.690} {41.770 125.405}} -scale 0.0478
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {41.915 125.305} -scale 0.0478
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start DeleteTool
icc2_shell> gui_set_mouse_tool_option -tool DeleteTool -option {removeDisconnected} -value false
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start DeleteTool
icc2_shell> gui_set_mouse_tool_option -tool DeleteTool -option {removeDisconnected} -value false
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start DeleteTool
icc2_shell> gui_set_mouse_tool_option -tool DeleteTool -option {removeDisconnected} -value false
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-42.845 69.325} -scale 0.1898
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> remove_physical_objects
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Warning: Some selected object cannot be edited. (LED-025)
icc2_shell> remove_physical_objects
Information: Extraction observers are detached as design net change threshold is reached.
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start DeleteTool
icc2_shell> gui_set_mouse_tool_option -tool DeleteTool -option {removeDisconnected} -value false
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {44.850 98.760} -scale 0.2048
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {44.850 98.760} -scale 0.2048
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {44.235 98.760} -scale 0.1024
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{44.235 98.760} {39.730 91.285}} -scale 0.1024
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {39.730 91.285} -scale 0.1024
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{39.935 90.770} {41.575 90.055}} -scale 0.1024
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {41.675 90.055} -scale 0.1024
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{43.520 86.780} {43.725 86.165}} -scale 0.1024
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-5.320 145.860} {335.870 -89.655}} -scale 0.4096
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {141.310 35.680} -scale 0.4096
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {139.675 35.680} -scale 0.4096
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start ReshapeTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{9.170 130.630} {36.690 86.105}} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start StretchConnectedTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{10.130 131.200} {40.130 74.830}} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start StretchConnectedTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start StretchConnectedTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{31.530 103.495} {48.155 87.060}} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{49.490 85.150} {31.340 85.530}} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{33.060 86.680} {40.320 84.765}} -scale 0.1911
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-36.225 115.150} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-36.225 115.150} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -apply
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{1.420 135.025} {187.345 -24.150}} -scale 0.1911
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start MoveTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{53.585 62.410} {-62.020 78.460}} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-5.090 64.530} {-54.010 65.100}} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-52.895 73.030} {-121.820 48.560}} -scale 0.2353
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-154.225 49.455} {-241.985 22.230}} -scale 0.2896
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start SplitTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-274.835 84.235} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-254.510 66.765} -scale 0.3566
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start AreaPushTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-264.140 72.825} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-177.490 -41.635} {-300.155 162.325}} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start QuickConnectTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start StretchConnectedTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start ReshapeTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-301.580 81.385} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-117.585 -76.220} -scale 0.3566
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_set_mouse_tool_option -tool ReshapeTool -option {mode} -value {Add}
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-310.140 107.415} {-176.420 -115.090}} -scale 0.3566
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start AlignTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-310.850 106.345} {-227.410 -17.740}} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-227.410 -17.740} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CopyTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-264.495 35.740} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-274.125 74.610} -scale 0.3566
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-248.805 21.480} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-266.280 17.200} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-262.715 73.895} -scale 0.3566
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CopyTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start AlignTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-312.990 66.050} {-250.945 6.505}} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {-277.335 19.340} -scale 0.3566
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CopyTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start CreateRouteTool
icc2_shell> gui_set_mouse_tool_option -tool CreateRouteTool -option {HorizontalWidth} -value {0.14}
icc2_shell> gui_set_mouse_tool_option -tool CreateRouteTool -option {HorizontalPitch} -value {0.32}
icc2_shell> gui_set_mouse_tool_option -tool CreateRouteTool -option {VerticalWidth} -value {0.16}
icc2_shell> gui_set_mouse_tool_option -tool CreateRouteTool -option {VerticalPitch} -value {0.32}
icc2_shell> 
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> set_working_design_stack counter.dlib:placement.design
icc2_shell> start_gui
icc2_shell> # CTS
icc2_shell> copy_block -from_block counter.dlib:placement.design -to_block CTS1
Information: The command 'copy_block' cleared the undo history. (UNDO-016)
Error: copy_block failed. Block 'CTS1.design' in library 'counter.dlib' is modified. (DES-018)
icc2_shell> current_block CTS1.design
{counter.dlib:CTS1.design}
icc2_shell> report_clock_qor -type structure
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
****************************************
Report : report clock qor
        -type structure
Design : i2c_master_top
Version: V-2023.12
Date   : Thu May 16 11:26:30 2024
****************************************

C0 is corner default

Printing structure of wb_clk_i at root pin wb_clk_i:
(0) wb_clk_i [in Port] [Location (0.22, 69.52)] [Net: wb_clk_i] [Fanout: 3] 
 (1) ZCTSINV_4865_581:INP->ZN [Ref: saed90nm_max_lth/INVX4] [Location (30.48, 41.68)] [Net: ZCTSNET_2] [Fanout: 2] 
  (2) ZCTSINV_4680_580:INP->ZN [Ref: saed90nm_max_lth/INVX0] [Location (40.72, 41.68)] [Net: ZCTSNET_1] [Fanout: 40] 
   (3) byte_controller/cmd_ack_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (61.41, 54.83)] [SINK PIN] 
   (3) prer_reg_4_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (38.91, 60.60)] [SINK PIN] 
   (3) prer_reg_8_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (39.87, 54.84)] [SINK PIN] 
   (3) ctr_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (39.65, 11.26)] [SINK PIN] 
   (3) prer_reg_9_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (39.55, 17.00)] [SINK PIN] 
   (3) prer_reg_1_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (28.35, 17.00)] [SINK PIN] 
   (3) ctr_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (28.45, 11.26)] [SINK PIN] 
   (3) prer_reg_6_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (50.11, 43.32)] [SINK PIN] 
   (3) prer_reg_14_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (51.07, 45.80)] [SINK PIN] 
   (3) prer_reg_15_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (51.07, 54.84)] [SINK PIN] 
   (3) prer_reg_7_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (48.19, 57.32)] [SINK PIN] 
   (3) prer_reg_12_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (51.39, 51.56)] [SINK PIN] 
   (3) cr_reg_6_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (61.41, 45.82)] [SINK PIN] 
   (3) cr_reg_5_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (61.73, 51.58)] [SINK PIN] 
   (3) ctr_reg_6_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (49.57, 28.54)] [SINK PIN] 
   (3) cr_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (51.48, 20.27)] [SINK PIN] 
   (3) cr_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (55.97, 11.26)] [SINK PIN] 
   (3) cr_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (54.05, 17.02)] [SINK PIN] 
   (3) irq_flag_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (50.53, 26.03)] [SINK PIN] 
   (3) ctr_reg_7_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (49.25, 34.30)] [SINK PIN] 
   (3) ctr_reg_4_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (48.93, 37.55)] [SINK PIN] 
   (3) prer_reg_0_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (35.07, 45.80)] [SINK PIN] 
   (3) ctr_reg_5_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (24.93, 43.30)] [SINK PIN] 
   (3) prer_reg_13_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (22.59, 49.08)] [SINK PIN] 
   (3) prer_reg_5_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (24.19, 45.80)] [SINK PIN] 
   (3) prer_reg_3_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (14.59, 40.04)] [SINK PIN] 
   (3) prer_reg_2_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (14.91, 31.80)] [SINK PIN] 
   (3) prer_reg_10_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (14.91, 26.04)] [SINK PIN] 
   (3) ctr_reg_3_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (16.29, 17.02)] [SINK PIN] 
   (3) ctr_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (16.93, 14.51)] [SINK PIN] 
   (3) wb_ack_o_reg/CLK [Ref: saed90nm_max_lth/DFFX2] [Location (15.28, 22.80)] [SINK PIN] 
   (3) prer_reg_11_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (14.91, 34.28)] [SINK PIN] 
   (3) byte_controller/bit_controller/cnt_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX2] [Location (37.72, 63.10)] [SINK PIN] 
   (3) byte_controller/bit_controller/cnt_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX2] [Location (22.36, 63.10)] [SINK PIN] 
   (3) byte_controller/bit_controller/cnt_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX2] [Location (23.00, 57.34)] [SINK PIN] 
   (3) byte_controller/bit_controller/cnt_reg_3_/CLK [Ref: saed90nm_max_lth/DFFARX2] [Location (22.68, 51.58)] [SINK PIN] 
   (3) byte_controller/bit_controller/cnt_reg_4_/CLK [Ref: saed90nm_max_lth/DFFARX2] [Location (20.44, 66.34)] [SINK PIN] 
   (3) byte_controller/bit_controller/cnt_reg_10_/CLK [Ref: saed90nm_max_lth/DFFARX2] [Location (37.72, 68.86)] [SINK PIN] 
   (3) byte_controller/c_state_reg_3_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (49.57, 63.10)] [SINK PIN] 
   (3) byte_controller/c_state_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (49.25, 66.34)] [SINK PIN] 
  (2) ZCTSINV_3676_579:INP->ZN [Ref: saed90nm_max_lth/IBUFFX2] [Location (35.60, 41.68)] [Net: ZCTSNET_0] [Fanout: 42] 
   (3) byte_controller/ack_out_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (72.61, 54.83)] [SINK PIN] 
   (3) cr_reg_4_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (76.77, 43.30)] [SINK PIN] 
   (3) cr_reg_3_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (77.41, 34.30)] [SINK PIN] 
   (3) wb_dat_o_reg_1_/CLK [Ref: saed90nm_max_lth/DFFX1] [Location (99.75, 11.25)] [SINK PIN] 
   (3) txr_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (100.77, 17.02)] [SINK PIN] 
   (3) txr_reg_3_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (100.77, 28.54)] [SINK PIN] 
   (3) txr_reg_4_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (99.17, 34.30)] [SINK PIN] 
   (3) tip_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (78.05, 28.54)] [SINK PIN] 
   (3) txr_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (89.89, 14.51)] [SINK PIN] 
   (3) txr_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (90.20, 20.27)] [SINK PIN] 
   (3) wb_dat_o_reg_5_/CLK [Ref: saed90nm_max_lth/DFFX1] [Location (90.15, 22.77)] [SINK PIN] 
   (3) txr_reg_6_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (89.56, 28.54)] [SINK PIN] 
   (3) wb_dat_o_reg_0_/CLK [Ref: saed90nm_max_lth/DFFX1] [Location (81.19, 26.03)] [SINK PIN] 
   (3) rxack_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (83.81, 54.83)] [SINK PIN] 
   (3) wb_dat_o_reg_6_/CLK [Ref: saed90nm_max_lth/DFFX1] [Location (117.35, 40.05)] [SINK PIN] 
   (3) wb_dat_o_reg_3_/CLK [Ref: saed90nm_max_lth/DFFX1] [Location (117.35, 34.29)] [SINK PIN] 
   (3) wb_dat_o_reg_2_/CLK [Ref: saed90nm_max_lth/DFFX1] [Location (117.35, 22.77)] [SINK PIN] 
   (3) wb_inta_o_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (119.01, 28.54)] [SINK PIN] 
   (3) wb_dat_o_reg_4_/CLK [Ref: saed90nm_max_lth/DFFX1] [Location (118.95, 31.79)] [SINK PIN] 
   (3) wb_dat_o_reg_7_/CLK [Ref: saed90nm_max_lth/DFFX1] [Location (116.07, 49.07)] [SINK PIN] 
   (3) txr_reg_5_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (92.77, 45.82)] [SINK PIN] 
   (3) txr_reg_7_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (92.77, 51.58)] [SINK PIN] 
   (3) al_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (81.25, 57.34)] [SINK PIN] 
   (3) cr_reg_7_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (75.17, 49.07)] [SINK PIN] 
   (3) byte_controller/sr_reg_3_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (101.73, 26.03)] [SINK PIN] 
   (3) byte_controller/sr_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (108.12, 11.26)] [SINK PIN] 
   (3) byte_controller/bit_controller/filter_cnt_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (94.37, 66.34)] [SINK PIN] 
   (3) byte_controller/bit_controller/filter_cnt_reg_3_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (94.37, 63.10)] [SINK PIN] 
   (3) byte_controller/bit_controller/filter_cnt_reg_9_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (110.69, 72.11)] [SINK PIN] 
   (3) byte_controller/bit_controller/filter_cnt_reg_8_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (112.61, 66.34)] [SINK PIN] 
   (3) byte_controller/bit_controller/filter_cnt_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (83.17, 63.10)] [SINK PIN] 
   (3) byte_controller/dcnt_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (114.84, 57.34)] [SINK PIN] 
   (3) byte_controller/dcnt_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (111.97, 63.10)] [SINK PIN] 
   (3) byte_controller/ld_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (103.65, 57.34)] [SINK PIN] 
   (3) byte_controller/shift_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (92.45, 57.34)] [SINK PIN] 
   (3) byte_controller/sr_reg_5_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (104.61, 43.30)] [SINK PIN] 
   (3) byte_controller/sr_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (117.73, 14.51)] [SINK PIN] 
   (3) byte_controller/sr_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (118.05, 20.27)] [SINK PIN] 
   (3) byte_controller/sr_reg_4_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (116.45, 43.30)] [SINK PIN] 
   (3) byte_controller/dcnt_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (115.17, 51.58)] [SINK PIN] 
   (3) byte_controller/sr_reg_7_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (103.97, 51.58)] [SINK PIN] 
   (3) byte_controller/sr_reg_6_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (104.29, 49.07)] [SINK PIN] 
 (1) byte_controller/ZCTSBUF_1353_577:INP->Z [Ref: saed90nm_max_lth/DELLN1X2] [Location (35.92, 99.28)] [Net: byte_controller/ZCTSNET_0] [Fanout: 33] 
  (2) byte_controller/bit_controller/c_state_reg_15_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (91.48, 118.19)] [SINK PIN] 
  (2) byte_controller/c_state_reg_4_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (67.48, 86.14)] [SINK PIN] 
  (2) byte_controller/core_cmd_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (66.20, 89.39)] [SINK PIN] 
  (2) byte_controller/core_txd_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (93.73, 91.90)] [SINK PIN] 
  (2) byte_controller/bit_controller/filter_cnt_reg_10_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (69.73, 80.38)] [SINK PIN] 
  (2) byte_controller/bit_controller/filter_cnt_reg_12_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (86.05, 89.39)] [SINK PIN] 
  (2) byte_controller/bit_controller/filter_cnt_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (87.97, 83.62)] [SINK PIN] 
  (2) byte_controller/bit_controller/filter_cnt_reg_11_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (82.53, 91.90)] [SINK PIN] 
  (2) byte_controller/bit_controller/cmd_ack_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (82.84, 95.15)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (94.37, 103.42)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_12_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (118.37, 100.91)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_16_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (119.65, 106.67)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_7_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (119.65, 112.43)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_8_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (119.33, 114.94)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_11_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (117.09, 97.66)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_10_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (104.93, 91.90)] [SINK PIN] 
  (2) byte_controller/bit_controller/filter_cnt_reg_13_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (103.33, 89.39)] [SINK PIN] 
  (2) byte_controller/bit_controller/filter_cnt_reg_7_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (114.53, 89.39)] [SINK PIN] 
  (2) byte_controller/bit_controller/filter_cnt_reg_6_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (116.12, 91.90)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_6_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (104.93, 97.66)] [SINK PIN] 
  (2) byte_controller/bit_controller/filter_cnt_reg_5_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (99.17, 83.62)] [SINK PIN] 
  (2) byte_controller/bit_controller/filter_cnt_reg_4_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (101.73, 80.38)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_9_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (93.73, 97.66)] [SINK PIN] 
  (2) byte_controller/bit_controller/al_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (71.65, 97.66)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_13_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (71.65, 100.91)] [SINK PIN] 
  (2) byte_controller/bit_controller/sda_oen_reg/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (83.39, 100.92)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (83.17, 103.42)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_5_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (90.84, 109.18)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_14_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (90.53, 114.94)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_3_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (97.25, 126.46)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (104.61, 120.70)] [SINK PIN] 
  (2) byte_controller/bit_controller/c_state_reg_4_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (108.77, 126.46)] [SINK PIN] 
  (2) byte_controller/bit_controller/sda_chk_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (93.09, 120.70)] [SINK PIN] 
 (1) byte_controller/ZCTSBUF_2377_578:INP->Z [Ref: saed90nm_max_lth/DELLN2X2] [Location (30.80, 93.52)] [Net: byte_controller/ZCTSNET_1] [Fanout: 38] 
  (2) byte_controller/bit_controller/cnt_reg_11_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (32.93, 80.38)] [SINK PIN] 
  (2) byte_controller/c_state_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (47.33, 72.11)] [SINK PIN] 
  (2) byte_controller/c_state_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (45.73, 77.87)] [SINK PIN] 
  (2) byte_controller/core_cmd_reg_2_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (51.80, 95.15)] [SINK PIN] 
  (2) byte_controller/core_cmd_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (63.01, 91.90)] [SINK PIN] 
  (2) byte_controller/core_cmd_reg_3_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (48.61, 89.39)] [SINK PIN] 
  (2) byte_controller/bit_controller/cnt_reg_8_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (45.09, 86.14)] [SINK PIN] 
  (2) byte_controller/bit_controller/cnt_reg_9_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (44.12, 80.38)] [SINK PIN] 
  (2) byte_controller/bit_controller/scl_oen_reg/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (59.71, 106.68)] [SINK PIN] 
  (2) byte_controller/bit_controller/dscl_oen_reg/CLK [Ref: saed90nm_max_lth/DFFX2] [Location (60.40, 109.20)] [SINK PIN] 
  (2) byte_controller/bit_controller/dout_reg/CLK [Ref: saed90nm_max_lth/DFFX1] [Location (61.03, 100.91)] [SINK PIN] 
  (2) byte_controller/bit_controller/clk_en_reg/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (61.31, 97.64)] [SINK PIN] 
  (2) byte_controller/bit_controller/dSCL_reg/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (46.27, 109.16)] [SINK PIN] 
  (2) byte_controller/bit_controller/sSDA_reg/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (46.59, 112.44)] [SINK PIN] 
  (2) byte_controller/bit_controller/sta_condition_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (47.01, 123.95)] [SINK PIN] 
  (2) byte_controller/bit_controller/cmd_stop_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (60.77, 126.46)] [SINK PIN] 
  (2) byte_controller/bit_controller/busy_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (60.12, 120.70)] [SINK PIN] 
  (2) byte_controller/bit_controller/sto_condition_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (60.12, 118.19)] [SINK PIN] 
  (2) byte_controller/bit_controller/dSDA_reg/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (46.59, 118.20)] [SINK PIN] 
  (2) byte_controller/bit_controller/sSCL_reg/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (35.71, 112.44)] [SINK PIN] 
  (2) byte_controller/bit_controller/fSDA_reg_2_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (35.39, 118.20)] [SINK PIN] 
  (2) byte_controller/bit_controller/fSDA_reg_1_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (35.71, 120.68)] [SINK PIN] 
  (2) byte_controller/bit_controller/fSDA_reg_0_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (35.39, 109.16)] [SINK PIN] 
  (2) byte_controller/bit_controller/slave_wait_reg/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (37.41, 103.42)] [SINK PIN] 
  (2) byte_controller/bit_controller/cnt_reg_15_/CLK [Ref: saed90nm_max_lth/DFFARX2] [Location (26.52, 100.90)] [SINK PIN] 
  (2) byte_controller/bit_controller/cSCL_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (14.69, 103.42)] [SINK PIN] 
  (2) byte_controller/bit_controller/fSCL_reg_2_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (13.63, 123.96)] [SINK PIN] 
  (2) byte_controller/bit_controller/fSCL_reg_1_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (13.95, 118.20)] [SINK PIN] 
  (2) byte_controller/bit_controller/fSCL_reg_0_/CLK [Ref: saed90nm_max_lth/DFFASX1] [Location (17.15, 114.92)] [SINK PIN] 
  (2) byte_controller/bit_controller/cSCL_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (14.37, 109.18)] [SINK PIN] 
  (2) byte_controller/bit_controller/cSDA_reg_0_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (15.33, 100.91)] [SINK PIN] 
  (2) byte_controller/bit_controller/cSDA_reg_1_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (26.53, 106.67)] [SINK PIN] 
  (2) byte_controller/bit_controller/cnt_reg_14_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (21.09, 97.66)] [SINK PIN] 
  (2) byte_controller/bit_controller/cnt_reg_12_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (19.80, 89.39)] [SINK PIN] 
  (2) byte_controller/bit_controller/cnt_reg_13_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (19.16, 95.15)] [SINK PIN] 
  (2) byte_controller/bit_controller/cnt_reg_6_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (20.45, 77.87)] [SINK PIN] 
  (2) byte_controller/bit_controller/cnt_reg_5_/CLK [Ref: saed90nm_max_lth/DFFARX2] [Location (19.48, 72.10)] [SINK PIN] 
  (2) byte_controller/bit_controller/cnt_reg_7_/CLK [Ref: saed90nm_max_lth/DFFARX1] [Location (21.73, 80.38)] [SINK PIN] 
1
icc2_shell> derive_clock_cell_references -output cts_leg_set.tcl > /dev/null
icc2_shell> set CTS_CELLS [get_lib_cells "*/NBUFFX2 */NBUFFX4 */NBUFFX8 "]
{saed90nm_max_lth/NBUFFX2 saed90nm_max_lth/NBUFFX4 saed90nm_max_lth/NBUFFX8}
icc2_shell> #NDR
icc2_shell> set CTS_NDR_MIN_ROUTING_LAYER       "M4"
M4
icc2_shell> set CTS_NDR_MAX_ROUTING_LAYER       "M5"
M5
icc2_shell> set CTS_LEAF_NDR_MIN_ROUTING_LAYER  "M1"
M1
icc2_shell> set CTS_LEAF_NDR_MAX_ROUTING_LAYER  "M5"
M5
icc2_shell> set CTS_NDR_RULE_NAME               "cts_w2_s2_vlg"
cts_w2_s2_vlg
icc2_shell> #set CTS_LEAF_NDR_RULE_NAME "cts_w1_s2"
icc2_shell> create_routing_rule $CTS_NDR_RULE_NAME              -default_reference_rule                 -taper_distance 0.4             -driver_taper_distance 0.4              -widths   {M3 0.16 M4 0.32 M5 0.32}             -spacings {M3 0.16 M4 0.32 M5 0.32}
Error: Non-default rule 'cts_w2_s2_vlg' already exists in the design. (DES-110)
icc2_shell> set_clock_routing_rules -rules $CTS_NDR_RULE_NAME           -min_routing_layer $CTS_NDR_MIN_ROUTING_LAYER           -max_routing_layer $CTS_NDR_MAX_ROUTING_LAYER
Information: The command 'set_clock_routing_rules' cleared the undo history. (UNDO-016)
1
icc2_shell> report_routing_rules -verbose
Name     WidthMltplr SpacingMltplr TaperDist DriverTaperDist TaperOverPinLayers TaperUnderPinLayers DriverTaperOverPinLayers DriverTaperUnderPinLayers ParallelWireLayers
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
cts_w2_s2_vlg
         1           1             0.40      0.40

         --------------------------------------------------------------------------------------
         Layer     Width     ShieldWth ShieldSpc Snap2Trck RdlTaperDist RdlTaperWidth Mask
         --------------------------------------------------------------------------------------

         M1        0.14

         M2        0.16

         M3        0.16

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.16      hard      0.00

         M4        0.32

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.32      hard      0.00

         M5        0.32

                   ---------------------------------------
                   Index     Spacing   Weight    Threshold
                   ---------------------------------------
                   0         0.32      hard      0.00

         M6        0.16

         M7        0.16

         M8        0.16

         M9        0.45
1
icc2_shell> report_clock_routing_rules
****************************************
 Report : clock routing rules
 Design : i2c_master_top
 Date   : Thu May 16 11:26:31 2024
****************************************
   Design Base; Net Type: all;      Rule: cts_w2_s2_vlg; Min Layer: M4; Max Layer: M5
   Design Base; Net Type: sink;     Rule: default rule; Min Layer: M1; Max Layer: M2

icc2_shell> #Sink pins will not follows NDRs
icc2_shell> set_clock_routing_rules -net_type sink -default_rule -min_routing_layer M1 -max_routing_layer M2
1
icc2_shell> #DRC
icc2_shell> report_ports -verbose [get_ports *clk*]
****************************************
Report : port
        -design_rule
        -input_delay
        -drive
        -output_delay
Module : i2c_master_top
Mode   : default
Corner : default
Scenario: default
Version: V-2023.12
Date   : Thu May 16 11:26:31 2024
****************************************
Attributes:
   I - ideal network
   H - HyperScale context override
                      Pin Cap                    Wire Cap
                   Min          Max           Min          Max
Port      Dir    rise/fall    rise/fall     rise/fall    rise/fall    Attributes
--------------------------------------------------------------------------------
wb_clk_i  in     0.00/0.00    0.00/0.00     0.00/0.00    0.00/0.00    

Port           MaxTrans MaxCap   MinCap
-------------------------------------------
wb_clk_i       0.12     96.00    1.00

                      Input Delay
                    Min             Max       Related Related
 Input Port     Rise    Fall    Rise    Fall   Clock   Pin       Attributes
----------------------------------------------------------------------------
wb_clk_i        --      --      --      --      --      --

            Resistance (min/max)
Input Port  Rise             Fall
--------------------------------------------------------------------------------
wb_clk_i    --               --

                      Driving Cell
Input Port     Type     Cell                Mult      Clock     Attrs
--------------------------------------------------------------------------------
wb_clk_i       min_rise NBUFFX4             
wb_clk_i       min_fall NBUFFX4             
wb_clk_i       max_rise NBUFFX4             
wb_clk_i       max_fall NBUFFX4             
1
icc2_shell> set_driving_cell -scenarios [all_scenarios] -lib_cell NBUFFX4 [get_ports *clk*]
1
icc2_shell> set_app_options -name time.remove_clock_reconvergence_pessimism -value true
time.remove_clock_reconvergence_pessimism true
icc2_shell> report_clock_settings
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
****************************************
 Report : clock settings
 Design : CTS1
 Date   : Thu May 16 11:26:31 2024
****************************************


======================================
Configurations 
======================================

##Global
  Corner = default
    Max transition: around 0.500 (default)
    Max capacitance: 600.000 (default)
    Target skew: 0 (default)
    Target latency: Not specified

##wb_clk_i
  Corner = default
    Max transition: around 0.500 (default)
    Max capacitance: 600.000 (default)
    Target skew: 0.750
    Target latency: 0.100


======================================
Routing Rules 
======================================

##Global
Routing rule for sink nets: Default Min Layer:M1 Max Layer:M2
Routing rule for internal nets: Not specified
Routing rule for root nets: Not specified
Routing rule for all nets: cts_w2_s2_vlg  Min Layer:M4 Max Layer:M5
Net-based routing rules (by set_clock_routing_rule): Not specified
Net-based routing rules (by set_routing_rule): Not specified

##wb_clk_i
Routing rule for sink nets: Not specified
Routing rule for internal nets: Not specified
Routing rule for root nets: Not specified
Routing rule for all nets: Not specified
Net-based routing rules (by set_clock_routing_rule): Not specified
Net-based routing rules (by set_routing_rule): Not specified


======================================
Buffers and Inverters 
======================================

##Buffers
Name                                   Area      Max Transition       Max Load
------------------------------------------------------------------------------
saed90nm_max_lth/DELLN1X2            14.746               1.024        416.000
saed90nm_max_lth/DELLN2X2            15.667               1.024        416.000
saed90nm_max_lth/DELLN3X2            22.118               1.024        416.000
saed90nm_max_lth/NBUFFX16            26.726               1.024        384.000
saed90nm_max_lth/NBUFFX2              5.530               1.024         48.000
saed90nm_max_lth/NBUFFX32            55.296               2.048        768.000
saed90nm_max_lth/NBUFFX4             10.138               1.024         96.000
saed90nm_max_lth/NBUFFX8             14.746               1.024        192.000
saed90nm_max_lth/AOBUFX1             22.118               1.024        208.000
saed90nm_max_lth/AOBUFX2             22.118               1.024        416.000
saed90nm_max_lth/AOBUFX4             27.648               1.024        832.000

##Inverters
Name                                   Area      Max Transition       Max Load
------------------------------------------------------------------------------
saed90nm_max_lth/IBUFFX16            31.334               1.024       3328.000
saed90nm_max_lth/IBUFFX2             10.138               1.024        416.000
saed90nm_max_lth/IBUFFX32            56.218               1.024       6656.000
saed90nm_max_lth/IBUFFX4             12.902               1.024        832.000
saed90nm_max_lth/IBUFFX8             18.432               1.024       1664.000
saed90nm_max_lth/INVX0                5.530               1.024        104.000
saed90nm_max_lth/INVX1                6.451               1.024        208.000
saed90nm_max_lth/INVX16              25.805               1.024       3328.000
saed90nm_max_lth/INVX2                6.451               1.024        416.000
saed90nm_max_lth/INVX32              47.002               1.024       6656.000
saed90nm_max_lth/INVX4                9.216               1.024        832.000
saed90nm_max_lth/INVX8               14.746               1.024       1664.000
saed90nm_max_lth/AOINVX1             22.118               1.024        208.000
saed90nm_max_lth/AOINVX2             22.118               1.024        416.000
saed90nm_max_lth/AOINVX4             18.432               1.024        832.000


======================================
Spacing Rules 
======================================

##By design
No by design spacing rule is specified

##By clock
No by clock spacing rule is specified

##By libcell
No by libcell spacing rule is specified

##By clock and libcell
No by clock and libcell spacing rule is specified
1
icc2_shell> #
icc2_shell> set_clock_tree_options -target_skew 0.5 -clock [get_clocks *]
1
icc2_shell> set_clock_tree_options -target_latency 0.1  -clock [get_clocks *]
1
icc2_shell> clock_opt
Information: Starting 'clock_opt' (FLW-8000)
Information: Time: 2024-05-16 11:26:31 / Session:  01:02:17 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 611 MB (FLW-8100)
INFO: clock_opt is running in balanced flow mode.
Warning: Cannot find any max transition constraint on the design. (OPT-070)
INFO: Total Power Aware Optimization Enabled (Dynamic + Leakage)
ERROR: Cannot run multiple iterations of clock_opt final_opto in GRE mode. 
Information: Running auto PG connection. (NDM-099)
Information: Ending   'clock_opt' (FLW-8001)
Information: Time: 2024-05-16 11:26:31 / Session:  01:02:17 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 611 MB (FLW-8100)
Error: 0
        Use error_info for more info. (CMD-013)
icc2_shell> remove_physical_objects
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start MoveTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{76.325 78.080} {-62.590 76.170}} -scale 0.1911
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{-18.320 64.555} {-136.490 55.135}} -scale 0.2048
Warning: One of the edited objects is outside of design boundary. (LED-023)
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> undo
1
icc2_shell> set_working_design_stack counter.dlib:placement.design
icc2_shell> open_block /eda/synopsys/final_project/pnr/counter.dlib:routing.design
Information: The command 'open_block' cleared the undo history. (UNDO-016)
Opening block 'counter.dlib:routing.design' in edit mode
icc2_shell> link_block
Using libraries: counter.dlib saed90nm_max_lth
Visiting block counter.dlib:routing.design
Design 'i2c_master_top' was successfully linked.
1
icc2_shell> remove_physical_objects
icc2_shell> set_working_design_stack counter.dlib:placement.design
icc2_shell> open_block /eda/synopsys/final_project/pnr/counter.dlib:routing.design
Information: The command 'open_block' cleared the undo history. (UNDO-016)
Information: Incrementing open_count of block 'counter.dlib:routing.design' to 2. (DES-021)
icc2_shell> set result [reopen_block]
{counter.dlib:routing.design}
icc2_shell> set_working_design_stack counter.dlib:placement.design
icc2_shell> # 1.routing
icc2_shell> copy_block -from_block counter.dlib:CTS1.design -to_block routing
Error: copy_block failed. Block 'routing.design' in library 'counter.dlib' is modified. (DES-018)
icc2_shell> current_block routing.design
{counter.dlib:routing.design}
icc2_shell> #  check for any issues that might cause problems during routing
icc2_shell> report_qor -summary
Information: Timer using 1 threads
****************************************
Report : qor
        -summary
Design : i2c_master_top
Version: V-2023.12
Date   : Thu May 16 11:33:17 2024
****************************************
Information: Corner default: no PVT mismatches. (PVT-032)
Information: The stitching and editing of coupling caps is turned OFF for design 'counter.dlib:routing.design'. (TIM-125)
Information: Design routing has 879 nets, 0 global routed, 822 detail routed. (NEX-024)
Information: The RC mode used is DR for design 'i2c_master_top'. (NEX-022)
---extraction options---
Corner: default
 late_cap_scale                : 1
 late_res_scale                : 1
 early_cap_scale               : 1
 early_res_scale               : 1
Global options:
 reference_direction       : use_from_tluplus
 real_metalfill_extraction : none
 virtual_shield_extraction : true
---app options---
 host.max_cores                   : 1
 extract.connect_open           : true
 extract.enable_coupling_cap    : false
Extracting design: routing 
Information: coupling capacitance is lumped to ground. (NEX-030)
Information: 822 nets are successfully extracted. (NEX-028)
Information: Design Average RC for design routing  (NEX-011)
Information: r = 0.512774 ohm/um, via_r = 0.858180 ohm/cut, c = 0.084549 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.870988 ohm/cut, c = 0.099039 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Warning: Advanced receiver model has not been enabled for detailed routed design. (TIM-204)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 877, routed nets = 822, across physical hierarchy nets = 0, parasitics cached nets = 877, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
************************************************************
Timer Settings:
Delay Calculation Style:                   auto
Signal Integrity Analysis:                 disabled
Timing Window Analysis:                    disabled
Advanced Waveform Propagation:             disabled
Variation Type:                            fixed_derate
Clock Reconvergence Pessimism Removal:     enabled
Advanced Receiver Model:                   disabled
LLE:                                       disabled
ML Acceleration:                           off
************************************************************
Information: Timer using 'CRPR'. (TIM-050)

Timing
---------------------------------------------------------------------------
Context                                 WNS            TNS            NVE
---------------------------------------------------------------------------
Design             (Setup)             1.54           0.00              0

Design             (Hold)              0.00           0.00              0
---------------------------------------------------------------------------

Miscellaneous
---------------------------------------------------------------------------
Cell Area (netlist):                          12412.11
Cell Area (netlist and physical only):        15508.68
Nets with DRC Violations:        0
1
icc2_shell> check_design -checks pre_route_stage
****************************************
 Report : check_design 
 Options: { pre_route_stage }
 Design : i2c_master_top
 Version: V-2023.12
 Date   : Thu May 16 11:33:21 2024
****************************************

Running mega-check 'pre_route_stage': 
    Running atomic-check 'design_mismatch'
    Running atomic-check 'scan_chain'
    Running atomic-check 'mv_design'
    Running atomic-check 'timing'
    Running atomic-check 'routability'
    Running atomic-check 'hier_pre_route'

  *** EMS Message summary ***
  ----------------------------------------------------------------------------------------------------
  Rule         Type   Count      Message
  ----------------------------------------------------------------------------------------------------
  CR-011       Error  52         Cell instance %instance is off the %orientation minimum grid at ...
  CR-030       Error  3          Port %instance %port at (%x1 %y1)_(%x2 %y2) on %layers is out of...
  DFT-011      Info   1          The design has no scan chain defined in the scandef.
  DMM-105      Info   30         Mismatch type %mmtype is detected on object type %objtype at obj...
  ----------------------------------------------------------------------------------------------------
  Total 86 EMS messages : 55 errors, 0 warnings, 31 info.
  ----------------------------------------------------------------------------------------------------

  *** Non-EMS message summary ***
  ----------------------------------------------------------------------------------------------------
  Rule         Type   Count      Message
  ----------------------------------------------------------------------------------------------------
  ZRT-015      Warn   1          Ignore contact %s.
  ZRT-026      Warn   2          Layer %s default pitch %.3f may be too small to handle up/down v...
  ZRT-027      Warn   1          Ignore %d top cell ports with no pins.
  ZRT-311      Warn   19         Skipping antenna analysis for net %s. The pin %s on cell %s does...
  ZRT-325      Warn   53         Skipping antenna analysis for net %s as it is open.
  ZRT-511      Warn   1          Cell contains tie connections which are not connected to real PG.
  ZRT-588      Error  1          The design is not legalized. Skip blocked port checkings.
  ZRT-619      Info   1          Via ladder engine would be activated for pattern must join conne...
  ZRT-626      Warn   2          High fanout net %s can affect runtime for antenna fixing.
  ZRT-703      Info   1          Option route.detail.force_end_on_preferred_grid will be ignored ...
  ZRT-706      Info   1          When applicable layer based tapering will taper up to %.2f in di...
  ZRT-707      Info   1          When applicable Min-max layer allow_pin_connection mode will all...
  ZRT-718      Info   1          When applicable Min-max layer allow_pin_connection mode will all...
  ZRT-720      Warn   3          Port  %s at {{%.3f,%.3f} {%.3f,%.3f}} is out of boundary. Cannot...
  ZRT-740      Warn   4          %s is unplaced.  This may impact routing result.
  ZRT-763      Warn   2          Cell %s is placed overlapping with other cells at {{%.3f %.3f} {...
  ZRT-764      Warn   2          PG net %s has opens.
  ----------------------------------------------------------------------------------------------------
  Total 96 non-EMS messages : 1 errors, 90 warnings, 5 info.
  ----------------------------------------------------------------------------------------------------

Warning: EMS database "check_design.ems" already exists, over-writing it. (EMS-040)

Information: EMS database is saved to file 'check_design.ems'.
Information: Non-EMS messages are saved into file 'check_design2024May16113318.log'.
1
icc2_shell> #antenna rules (change the directory according to your project)
icc2_shell> source /eda/synopsys/project/standardCell/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Digital_Standard_cell_Library/process/astro/tech/saed90nm_1p9m_antenna.tcl
1
icc2_shell> ## Routing  (Performs all routing stages in one step the command runs global routing, track assignment, and detail routing )
icc2_shell> route_auto
Information: Starting 'route_auto' (FLW-8000)
Information: Time: 2024-05-16 11:33:23 / Session:  01:09:08 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 829 MB (FLW-8100)
Information: The net parasitics of block i2c_master_top are cleared. (TIM-123)
Warning: Cell contains tie connections which are not connected to real PG. (ZRT-511)
Warning: Ignore contact DIFFCON. (ZRT-015)
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M9
Found antenna rule mode 4, diode mode 2:
        layer M1:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M2:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M3:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M4:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M5:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M6:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M7:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M8:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M9:  max ratio 1000, diode ratio {0.06 0 8000 50000} 
        layer CO: , diode ratio {0 0 1 0 0} 
        layer VIA1:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA2:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA3:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA4:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA5:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA6:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA7:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA8:  max ratio 20, diode ratio {0.06 0 210 900} 
Information: Option route.detail.force_end_on_preferred_grid will be ignored since none of the layers have preferred grid. (ZRT-703)
Warning: Port GVDD of cell routing
        is unplaced.  This may impact routing result. (ZRT-740)
Warning: Port GVSS of cell routing
        is unplaced.  This may impact routing result. (ZRT-740)
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Information: Via ladder engine would be activated for pattern must join connection in certain commands. Please refer to man-page for the command list. (ZRT-619)
Warning: Port  Z at {{127.515,57.930} {142.195,59.640}} is out of boundary. Cannot be routed. (ZRT-720)
Warning: Port  VDD at {{123.665,59.125} {142.865,60.265}} is out of boundary. Cannot be routed. (ZRT-720)
Warning: Port  VSS at {{123.665,57.225} {142.865,58.225}} is out of boundary. Cannot be routed. (ZRT-720)
Skipping 3 ectangle_only route guides because they don't cover the design boundary in the layer's  preferred direction.
Warning: Contact VIA89's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 default pitch 0.320 may be too small to handle up/down via. Note, that minimum requirements are "wire/via-down 0.315" & "wire/via-up 0.330". (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 default pitch 0.320 may be too small to handle up/down via. Note, that minimum requirements are "wire/via-down 0.360" & "wire/via-up 0.320". (ZRT-026)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 7.50 outside the layer range. (ZRT-707)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 7.50 outside the layer range on clock nets. (ZRT-718)
Information: When applicable layer based tapering will taper up to 0.00 in distance from the pin. (ZRT-706)
Warning: Cell byte_controller/bit_controller/cnt_reg_4_ is placed overlapping with other cells at {{18.960 64.720} {30.800 67.600}}. (ZRT-763)
Warning: Cell byte_controller/bit_controller/cnt_reg_9_ is placed overlapping with other cells at {{42.640 79.120} {53.840 82.000}}. (ZRT-763)

    Found 0 via ladders to verify.

VIA LADDER INFO: found 0 via ladder DRCs across 0 nets.
Updating the database ...

    Via ladders will be inserted on 0 of 0 ports with via ladder constraints.

Updating the database ...
Information: Skipping global routing as it has already been run in the global_route_opt stage of clock_opt. (ZRT-607)

Start track assignment

Printing options for 'route.common.*'
common.eco_route_fix_existing_drc                       :        true                
common.verbose_level                                    :        0                   

Printing options for 'route.track.*'

Loading parastics information to the router ...
parastics information loaded to the router.
Information: Using 1 threads for routing. (ZRT-444)

[Track Assign: TA init] Elapsed real time: 0:00:00 
[Track Assign: TA init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Track Assign: TA init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Track Assign: TA init] Total (MB): Used   19  Alloctr   20  Proc 5440 
Printing options for 'route.common.*'
common.eco_route_fix_existing_drc                       :        true                
common.verbose_level                                    :        0                   

Printing options for 'route.detail.*'
detail.antenna                                          :        true                
detail.eco_route_use_soft_spacing_for_timing_optimization:       true                

Printing options for 'route.auto_via_ladder.*'

Information: RC layer preference is turned on for this design. (ZRT-613)
[Dr init] Elapsed real time: 0:00:00 
[Dr init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Dr init] Stage (MB): Used   10  Alloctr   10  Proc   49 
[Dr init] Total (MB): Used   29  Alloctr   30  Proc 5489 
Total number of nets = 881, of which 0 are not extracted
Total number of open nets = 108, of which 0 are frozen
Information: Using 1 threads for routing. (ZRT-444)
*****Start reporting antenna related parameters*****
  Antenna/diode mode:
    Antenna mode 4; diode mode 2
      Metal lay (M1)0; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA1)1; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M2)1; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA2)2; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M3)2; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA3)3; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M4)3; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA4)4; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M5)4; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA5)5; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M6)5; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA6)6; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M7)6; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA7)7; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M8)7; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA8)8; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M9)8; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 8000.000 50000.000 0.000)
  Top lay antenna ratio fix threshold == -1
  Antenna max pin count threshold == -1
  Check PG net == false
  MergeGate == true
  Break antenna to port mode == float
  Break antenna to macro pin mode == normal
*****End reporting antenna related parameters*****
Warning: Skipping antenna analysis for net wb_clk_i. The pin wb_clk_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_rst_i. The pin wb_rst_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net arst_i. The pin arst_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_adr_i[2]. The pin wb_adr_i[2] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_adr_i[1]. The pin wb_adr_i[1] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_adr_i[0]. The pin wb_adr_i[0] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[7]. The pin wb_dat_i[7] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[6]. The pin wb_dat_i[6] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[5]. The pin wb_dat_i[5] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[4]. The pin wb_dat_i[4] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[3]. The pin wb_dat_i[3] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[2]. The pin wb_dat_i[2] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[1]. The pin wb_dat_i[1] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[0]. The pin wb_dat_i[0] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_we_i. The pin wb_we_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_stb_i. The pin wb_stb_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_cyc_i. The pin wb_cyc_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net scl_pad_i. The pin scl_pad_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net sda_pad_i. The pin sda_pad_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net N43 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net N45 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net done as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net N121 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net n65 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net prer[2] as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/N105 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/n9 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/n10 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/n36 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/n47 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/N36 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/N67 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/N104 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/N139 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n450 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n490 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n107 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n140 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n142 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n167 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n169 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n170 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n171 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n173 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n174 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n175 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n176 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n177 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n380 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n65 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/n740 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/filter_cnt[4] as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/net_PTECO_HOLD_NET1 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/copt_net_33 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/net_PTECO_HOLD_NET2 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/net_PTECO_HOLD_NET3 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/net_PTECO_HOLD_NET4 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/net_PTECO_HOLD_NET5 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/copt_net_52 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/net_PTECO_HOLD_NET6 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net net_PTECO_HOLD_NET7 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net copt_net_104 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/net_PTECO_HOLD_NET16 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/bit_controller/net_PTECO_HOLD_NET17 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net net_PTECO_HOLD_NET23 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/net_PTECO_HOLD_NET24 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net net_PTECO_HOLD_NET26 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/net_PTECO_HOLD_NET35 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/net_PTECO_HOLD_NET37 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net net_PTECO_HOLD_NET39 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/net_PTECO_HOLD_NET41 as it is open. (ZRT-325)
Warning: Skipping antenna analysis for net byte_controller/net_PTECO_HOLD_NET47 as it is open. (ZRT-325)
Skipping antenna analysis for 19 nets as they don't have enough gate area info.
Skipping antenna analysis for 53 additional nets as they are open.
Start DR iteration 0: uniform partition
Routed  1/25 Partitions, Violations =   9
Routed  2/25 Partitions, Violations =   10
Routed  3/25 Partitions, Violations =   14
Routed  4/25 Partitions, Violations =   53
Routed  5/25 Partitions, Violations =   61
Routed  6/25 Partitions, Violations =   143
Routed  7/25 Partitions, Violations =   143
Routed  8/25 Partitions, Violations =   166
Routed  9/25 Partitions, Violations =   168
Routed  10/25 Partitions, Violations =  206
Routed  11/25 Partitions, Violations =  334
Routed  12/25 Partitions, Violations =  530
Routed  13/25 Partitions, Violations =  545
Routed  14/25 Partitions, Violations =  545
Routed  15/25 Partitions, Violations =  545
Routed  16/25 Partitions, Violations =  595
Routed  17/25 Partitions, Violations =  615
Routed  18/25 Partitions, Violations =  686
Routed  19/25 Partitions, Violations =  757
Routed  20/25 Partitions, Violations =  757
Routed  21/25 Partitions, Violations =  757
Routed  22/25 Partitions, Violations =  780
Routed  23/25 Partitions, Violations =  806
Routed  24/25 Partitions, Violations =  804
Routed  25/25 Partitions, Violations =  804

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      804
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 284
        Less than minimum width : 3
        Same net spacing : 20
        Short : 497

[Iter 0] Elapsed real time: 0:00:05 
[Iter 0] Elapsed cpu  time: sys=0:00:00 usr=0:00:05 total=0:00:05
[Iter 0] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 0] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 0 with 25 parts

Start DR iteration 1: non-uniform partition
Routed  1/24 Partitions, Violations =   800
Routed  2/24 Partitions, Violations =   795
Routed  3/24 Partitions, Violations =   792
Routed  4/24 Partitions, Violations =   793
Routed  5/24 Partitions, Violations =   737
Routed  6/24 Partitions, Violations =   736
Routed  7/24 Partitions, Violations =   738
Routed  8/24 Partitions, Violations =   738
Routed  9/24 Partitions, Violations =   739
Routed  10/24 Partitions, Violations =  737
Routed  11/24 Partitions, Violations =  749
Routed  12/24 Partitions, Violations =  754
Routed  13/24 Partitions, Violations =  757
Routed  14/24 Partitions, Violations =  757
Routed  15/24 Partitions, Violations =  755
Routed  16/24 Partitions, Violations =  746
Routed  17/24 Partitions, Violations =  740
Routed  18/24 Partitions, Violations =  741
Routed  19/24 Partitions, Violations =  741
Routed  20/24 Partitions, Violations =  743
Routed  21/24 Partitions, Violations =  744
Routed  22/24 Partitions, Violations =  750
Routed  23/24 Partitions, Violations =  751
Routed  24/24 Partitions, Violations =  738

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      738
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 245
        Less than minimum width : 5
        Same net spacing : 25
        Short : 463

[Iter 1] Elapsed real time: 0:00:10 
[Iter 1] Elapsed cpu  time: sys=0:00:00 usr=0:00:10 total=0:00:10
[Iter 1] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 1] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 1 with 24 parts

Start DR iteration 2: non-uniform partition
Routed  1/23 Partitions, Violations =   744
Routed  2/23 Partitions, Violations =   740
Routed  3/23 Partitions, Violations =   739
Routed  4/23 Partitions, Violations =   749
Routed  5/23 Partitions, Violations =   748
Routed  6/23 Partitions, Violations =   750
Routed  7/23 Partitions, Violations =   753
Routed  8/23 Partitions, Violations =   752
Routed  9/23 Partitions, Violations =   747
Routed  10/23 Partitions, Violations =  737
Routed  11/23 Partitions, Violations =  737
Routed  12/23 Partitions, Violations =  740
Routed  13/23 Partitions, Violations =  737
Routed  14/23 Partitions, Violations =  736
Routed  15/23 Partitions, Violations =  739
Routed  16/23 Partitions, Violations =  742
Routed  17/23 Partitions, Violations =  748
Routed  18/23 Partitions, Violations =  748
Routed  19/23 Partitions, Violations =  745
Routed  20/23 Partitions, Violations =  744
Routed  21/23 Partitions, Violations =  746
Routed  22/23 Partitions, Violations =  745
Routed  23/23 Partitions, Violations =  741

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      741
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 280
        Less than minimum width : 5
        Same net spacing : 33
        Short : 423

[Iter 2] Elapsed real time: 0:00:17 
[Iter 2] Elapsed cpu  time: sys=0:00:00 usr=0:00:17 total=0:00:17
[Iter 2] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 2] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 2 with 23 parts

Start DR iteration 3: non-uniform partition
Routed  1/20 Partitions, Violations =   747
Routed  2/20 Partitions, Violations =   754
Routed  3/20 Partitions, Violations =   741
Routed  4/20 Partitions, Violations =   723
Routed  5/20 Partitions, Violations =   720
Routed  6/20 Partitions, Violations =   720
Routed  7/20 Partitions, Violations =   710
Routed  8/20 Partitions, Violations =   700
Routed  9/20 Partitions, Violations =   697
Routed  10/20 Partitions, Violations =  698
Routed  11/20 Partitions, Violations =  698
Routed  12/20 Partitions, Violations =  699
Routed  13/20 Partitions, Violations =  700
Routed  14/20 Partitions, Violations =  695
Routed  15/20 Partitions, Violations =  696
Routed  16/20 Partitions, Violations =  682
Routed  17/20 Partitions, Violations =  694
Routed  18/20 Partitions, Violations =  695
Routed  19/20 Partitions, Violations =  692
Routed  20/20 Partitions, Violations =  687

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      687
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 227
        Less than minimum width : 7
        Same net spacing : 23
        Short : 430

[Iter 3] Elapsed real time: 0:00:26 
[Iter 3] Elapsed cpu  time: sys=0:00:00 usr=0:00:27 total=0:00:27
[Iter 3] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 3] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 3 with 20 parts

Start DR iteration 4: non-uniform partition
Routed  1/19 Partitions, Violations =   684
Routed  2/19 Partitions, Violations =   683
Routed  3/19 Partitions, Violations =   682
Routed  4/19 Partitions, Violations =   684
Routed  5/19 Partitions, Violations =   689
Routed  6/19 Partitions, Violations =   704
Routed  7/19 Partitions, Violations =   701
Routed  8/19 Partitions, Violations =   696
Routed  9/19 Partitions, Violations =   681
Routed  10/19 Partitions, Violations =  675
Routed  11/19 Partitions, Violations =  661
Routed  12/19 Partitions, Violations =  661
Routed  13/19 Partitions, Violations =  656
Routed  14/19 Partitions, Violations =  661
Routed  15/19 Partitions, Violations =  662
Routed  16/19 Partitions, Violations =  671
Routed  17/19 Partitions, Violations =  664
Routed  18/19 Partitions, Violations =  660
Routed  19/19 Partitions, Violations =  658

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      658
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 244
        Less than minimum width : 4
        Same net spacing : 22
        Short : 388

[Iter 4] Elapsed real time: 0:00:36 
[Iter 4] Elapsed cpu  time: sys=0:00:00 usr=0:00:37 total=0:00:38
[Iter 4] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 4] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 4 with 19 parts

Start DR iteration 5: non-uniform partition
Routed  1/18 Partitions, Violations =   656
Routed  2/18 Partitions, Violations =   660
Routed  3/18 Partitions, Violations =   660
Routed  4/18 Partitions, Violations =   660
Routed  5/18 Partitions, Violations =   681
Routed  6/18 Partitions, Violations =   688
Routed  7/18 Partitions, Violations =   702
Routed  8/18 Partitions, Violations =   687
Routed  9/18 Partitions, Violations =   664
Routed  10/18 Partitions, Violations =  668
Routed  11/18 Partitions, Violations =  667
Routed  12/18 Partitions, Violations =  680
Routed  13/18 Partitions, Violations =  681
Routed  14/18 Partitions, Violations =  684
Routed  15/18 Partitions, Violations =  690
Routed  16/18 Partitions, Violations =  687
Routed  17/18 Partitions, Violations =  715
Routed  18/18 Partitions, Violations =  714

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      714
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 263
        Less than minimum width : 6
        Same net spacing : 24
        Short : 421

[Iter 5] Elapsed real time: 0:00:46 
[Iter 5] Elapsed cpu  time: sys=0:00:00 usr=0:00:47 total=0:00:47
[Iter 5] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 5] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 5 with 18 parts

Start DR iteration 6: non-uniform partition
Routed  1/19 Partitions, Violations =   708
Routed  2/19 Partitions, Violations =   708
Routed  3/19 Partitions, Violations =   699
Routed  4/19 Partitions, Violations =   694
Routed  5/19 Partitions, Violations =   693
Routed  6/19 Partitions, Violations =   695
Routed  7/19 Partitions, Violations =   691
Routed  8/19 Partitions, Violations =   697
Routed  9/19 Partitions, Violations =   697
Routed  10/19 Partitions, Violations =  704
Routed  11/19 Partitions, Violations =  715
Routed  12/19 Partitions, Violations =  725
Routed  13/19 Partitions, Violations =  729
Routed  14/19 Partitions, Violations =  716
Routed  15/19 Partitions, Violations =  703
Routed  16/19 Partitions, Violations =  703
Routed  17/19 Partitions, Violations =  676
Routed  18/19 Partitions, Violations =  662
Routed  19/19 Partitions, Violations =  674

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      674
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 236
        Less than minimum width : 4
        Same net spacing : 26
        Short : 408

[Iter 6] Elapsed real time: 0:00:59 
[Iter 6] Elapsed cpu  time: sys=0:00:00 usr=0:01:01 total=0:01:01
[Iter 6] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 6] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 6 with 19 parts

Start DR iteration 7: non-uniform partition
Routed  1/18 Partitions, Violations =   672
Routed  2/18 Partitions, Violations =   668
Routed  3/18 Partitions, Violations =   662
Routed  4/18 Partitions, Violations =   663
Routed  5/18 Partitions, Violations =   668
Routed  6/18 Partitions, Violations =   679
Routed  7/18 Partitions, Violations =   676
Routed  8/18 Partitions, Violations =   674
Routed  9/18 Partitions, Violations =   684
Routed  10/18 Partitions, Violations =  684
Routed  11/18 Partitions, Violations =  685
Routed  12/18 Partitions, Violations =  676
Routed  13/18 Partitions, Violations =  680
Routed  14/18 Partitions, Violations =  686
Routed  15/18 Partitions, Violations =  682
Routed  16/18 Partitions, Violations =  668
Routed  17/18 Partitions, Violations =  670
Routed  18/18 Partitions, Violations =  667

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      667
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 234
        Less than minimum width : 6
        Same net spacing : 35
        Short : 392

[Iter 7] Elapsed real time: 0:01:13 
[Iter 7] Elapsed cpu  time: sys=0:00:00 usr=0:01:15 total=0:01:15
[Iter 7] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 7] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 7 with 18 parts

Start DR iteration 8: non-uniform partition
Routed  1/17 Partitions, Violations =   687
Routed  2/17 Partitions, Violations =   698
Routed  3/17 Partitions, Violations =   701
Routed  4/17 Partitions, Violations =   705
Routed  5/17 Partitions, Violations =   720
Routed  6/17 Partitions, Violations =   720
Routed  7/17 Partitions, Violations =   713
Routed  8/17 Partitions, Violations =   715
Routed  9/17 Partitions, Violations =   715
Routed  10/17 Partitions, Violations =  706
Routed  11/17 Partitions, Violations =  715
Routed  12/17 Partitions, Violations =  717
Routed  13/17 Partitions, Violations =  714
Routed  14/17 Partitions, Violations =  709
Routed  15/17 Partitions, Violations =  710
Routed  16/17 Partitions, Violations =  702
Routed  17/17 Partitions, Violations =  704

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      704
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 260
        Less than minimum area : 1
        Less than minimum width : 4
        Same net spacing : 22
        Short : 417

[Iter 8] Elapsed real time: 0:01:27 
[Iter 8] Elapsed cpu  time: sys=0:00:00 usr=0:01:30 total=0:01:31
[Iter 8] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 8] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 8 with 17 parts

Start DR iteration 9: non-uniform partition
Routed  1/19 Partitions, Violations =   695
Routed  2/19 Partitions, Violations =   691
Routed  3/19 Partitions, Violations =   688
Routed  4/19 Partitions, Violations =   685
Routed  5/19 Partitions, Violations =   657
Routed  6/19 Partitions, Violations =   651
Routed  7/19 Partitions, Violations =   654
Routed  8/19 Partitions, Violations =   662
Routed  9/19 Partitions, Violations =   667
Routed  10/19 Partitions, Violations =  678
Routed  11/19 Partitions, Violations =  675
Routed  12/19 Partitions, Violations =  677
Routed  13/19 Partitions, Violations =  691
Routed  14/19 Partitions, Violations =  678
Routed  15/19 Partitions, Violations =  681
Routed  16/19 Partitions, Violations =  683
Routed  17/19 Partitions, Violations =  682
Routed  18/19 Partitions, Violations =  685
Routed  19/19 Partitions, Violations =  685

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      685
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 258
        Less than minimum width : 6
        Same net spacing : 24
        Short : 397

[Iter 9] Elapsed real time: 0:01:46 
[Iter 9] Elapsed cpu  time: sys=0:00:00 usr=0:01:49 total=0:01:49
[Iter 9] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 9] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 9 with 19 parts

Start DR iteration 10: non-uniform partition
Routed  1/17 Partitions, Violations =   697
Routed  2/17 Partitions, Violations =   684
Routed  3/17 Partitions, Violations =   679
Routed  4/17 Partitions, Violations =   664
Routed  5/17 Partitions, Violations =   669
Routed  6/17 Partitions, Violations =   666
Routed  7/17 Partitions, Violations =   671
Routed  8/17 Partitions, Violations =   688
Routed  9/17 Partitions, Violations =   725
Routed  10/17 Partitions, Violations =  721
Routed  11/17 Partitions, Violations =  723
Routed  12/17 Partitions, Violations =  722
Routed  13/17 Partitions, Violations =  715
Routed  14/17 Partitions, Violations =  706
Routed  15/17 Partitions, Violations =  717
Routed  16/17 Partitions, Violations =  708
Routed  17/17 Partitions, Violations =  707

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      707
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 258
        Less than minimum width : 5
        Same net spacing : 34
        Short : 410

[Iter 10] Elapsed real time: 0:02:03 
[Iter 10] Elapsed cpu  time: sys=0:00:00 usr=0:02:07 total=0:02:08
[Iter 10] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 10] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 10 with 17 parts

Incremental DRC patching before early termination:
Routed  1/17 Partitions, Violations =   707
Routed  2/17 Partitions, Violations =   718
Routed  3/17 Partitions, Violations =   717
Routed  4/17 Partitions, Violations =   705
Routed  5/17 Partitions, Violations =   696
Routed  6/17 Partitions, Violations =   699
Routed  7/17 Partitions, Violations =   707
Routed  8/17 Partitions, Violations =   709
Routed  9/17 Partitions, Violations =   709
Routed  10/17 Partitions, Violations =  708
Routed  11/17 Partitions, Violations =  708
Routed  12/17 Partitions, Violations =  708
Routed  13/17 Partitions, Violations =  707
Routed  14/17 Partitions, Violations =  707
Routed  15/17 Partitions, Violations =  707
Routed  16/17 Partitions, Violations =  707
Routed  17/17 Partitions, Violations =  707

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      707
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 253
        Less than minimum width : 5
        Same net spacing : 34
        Short : 415

[Iter 11] Elapsed real time: 0:02:04 
[Iter 11] Elapsed cpu  time: sys=0:00:00 usr=0:02:08 total=0:02:08
[Iter 11] Stage (MB): Used   71  Alloctr   71  Proc   49 
[Iter 11] Total (MB): Used   91  Alloctr   92  Proc 5489 

End DR iteration 11 with 17 parts

Stop DR since not converging

        @@@@ Total nets not meeting constraints =       0

[DR] Elapsed real time: 0:02:04 
[DR] Elapsed cpu  time: sys=0:00:00 usr=0:02:08 total=0:02:08
[DR] Stage (MB): Used    0  Alloctr    0  Proc   49 
[DR] Total (MB): Used   20  Alloctr   20  Proc 5489 
[DR: Done] Elapsed real time: 0:02:04 
[DR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:02:08 total=0:02:08
[DR: Done] Stage (MB): Used    0  Alloctr    0  Proc   49 
[DR: Done] Total (MB): Used   20  Alloctr   20  Proc 5489 

DR finished with 108 open nets, of which 0 are frozen
Information: Merged away 248 aligned/redundant DRCs. (ZRT-305)

DR finished with 459 violations and 0 instance ports antenna violations

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      459
        Diff net spacing : 158
        Less than minimum width : 5
        Same net spacing : 29
        Short : 267



Total Wire Length =                    20061 micron
Total Number of Contacts =             5557
Total Number of Wires =                6066
Total Number of PtConns =              368
Total Number of Routed Wires =       6009
Total Routed Wire Length =           19965 micron
Total Number of Routed Contacts =       5557
        Layer          M1 :        601 micron
        Layer          M2 :       8627 micron
        Layer          M3 :       7639 micron
        Layer          M4 :       1770 micron
        Layer          M5 :       1328 micron
        Layer          M6 :          0 micron
        Layer          M7 :          0 micron
        Layer          M8 :          0 micron
        Layer          M9 :          0 micron
        Via        VIA45C :        116
        Via   VIA45C(rot) :          1
        Via   VIA34C(rot) :        329
        Via        VIA23C :       2413
        Via        VIA12C :         11
        Via   VIA12C(rot) :       2298
        Via        VIA12B :         15
        Via   VIA12B(rot) :        374

 
Redundant via conversion report:
--------------------------------

  Total optimized via conversion rate =  0.00% (0 / 5557 vias)
 
    Layer VIA1       =  0.00% (0      / 2698    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2698    vias)
    Layer VIA2       =  0.00% (0      / 2413    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2413    vias)
    Layer VIA3       =  0.00% (0      / 329     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (329     vias)
    Layer VIA4       =  0.00% (0      / 117     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (117     vias)
 
  Total double via conversion rate    =  0.00% (0 / 5557 vias)
 
    Layer VIA1       =  0.00% (0      / 2698    vias)
    Layer VIA2       =  0.00% (0      / 2413    vias)
    Layer VIA3       =  0.00% (0      / 329     vias)
    Layer VIA4       =  0.00% (0      / 117     vias)
 
  The optimized via conversion rate based on total routed via count =  0.00% (0 / 5557 vias)
 
    Layer VIA1       =  0.00% (0      / 2698    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2698    vias)
    Layer VIA2       =  0.00% (0      / 2413    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2413    vias)
    Layer VIA3       =  0.00% (0      / 329     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (329     vias)
    Layer VIA4       =  0.00% (0      / 117     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (117     vias)
 

Total number of nets = 881
108 open nets, of which 0 are frozen
Total number of excluded ports = 0 ports of 0 unplaced cells connected to 0 nets
                                 0 ports without pins of 0 cells connected to 0 nets
                                 0 ports of 0 cover cells connected to 0 non-pg nets
Total number of DRCs = 459
Total number of antenna violations = 0
Information: Routes in non-preferred voltage areas = 0 (ZRT-559)

Topology ECO not run, no qualifying violations or in frozen nets.
Updating the database ...
Information: Extraction observers are detached as design net change threshold is reached.
rtapiOptAttrInterf: set attribute check_routability_called=1715848527 
Information: Ending   'route_auto' (FLW-8001)
Information: Time: 2024-05-16 11:35:27 / Session:  01:11:13 / Command:  00:02:04 / CPU:  00:02:08 / Memory: 878 MB (FLW-8100)
icc2_shell> # Routing Optimization
icc2_shell> route_opt
Information: Starting 'route_opt' (FLW-8000)
Information: Time: 2024-05-16 11:35:27 / Session:  01:11:13 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 878 MB (FLW-8100)
INFO: route_opt is running in balanced flow mode
Warning: SI analysis is not enabled for post-route optimization. (ROPT-002)
Warning: Cannot find any max transition constraint on the design. (OPT-070)
INFO: Total Power Aware Optimization Enabled (Dynamic + Leakage)
Route-opt command begin                   CPU:   901 s (  0.25 hr )  ELAPSE:  4274 s (  1.19 hr )  MEM-PEAK:   878 MB
Warning: SI analysis is not enabled for post-route optimization. (ROPT-002)
Warning: Cannot find any max transition constraint on the design. (OPT-070)
INFO: place.legalize.enable_advanced_legalizer not set - need to revert CLO
INFO: Concurrent Legalization and Optimization (CLO) Reverted
INFO: place.legalize.enable_advanced_legalizer not set - need to revert CLO
Information: The stitching and editing of coupling caps is turned OFF for design 'counter.dlib:routing.design'. (TIM-125)
Information: Design routing has 879 nets, 0 global routed, 796 detail routed. (NEX-024)
Information: The RC mode used is DR for design 'i2c_master_top'. (NEX-022)
---extraction options---
Corner: default
 late_cap_scale                : 1
 late_res_scale                : 1
 early_cap_scale               : 1
 early_res_scale               : 1
Global options:
 reference_direction       : use_from_tluplus
 real_metalfill_extraction : none
 virtual_shield_extraction : true
---app options---
 host.max_cores                   : 1
 extract.connect_open           : true
 extract.enable_coupling_cap    : false
Extracting design: routing 
Information: coupling capacitance is lumped to ground. (NEX-030)
Information: 796 nets are successfully extracted. (NEX-028)
Information: Design Average RC for design routing  (NEX-011)
Information: r = 0.512774 ohm/um, via_r = 0.858180 ohm/cut, c = 0.084549 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 0.562500 ohm/um, via_r = 0.870988 ohm/cut, c = 0.099039 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Warning: Advanced receiver model has not been enabled for detailed routed design. (TIM-204)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 877, routed nets = 796, across physical hierarchy nets = 0, parasitics cached nets = 877, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
Info: update em.

Route-opt timing update complete          CPU:   902 s (  0.25 hr )  ELAPSE:  4275 s (  1.19 hr )  MEM-PEAK:   878 MB
INFO: Propagating Switching Activities
Information: Activity propagation will be performed for scenario default.
Information: Doing activity propagation for mode 'default' and corner 'default' with effort level 'medium'. (POW-024)
Information: Timer-derived activity data is cached on scenario default (POW-052)
Information: Running switching activity propagation in scalar mode!

 **** Information : No. of simulation cycles = 7 ****
INFO: Switching Activity propagation took     0.00005 sec
INFO: Propagating Switching Activity for all power flows 

Route-opt initial QoR
_____________________
Scenario Mapping Table
1: default

Pathgroup Mapping Table
1: **default**
2: **async_default**
3: **clock_gating_default**
4: **in2reg_default**
5: **reg2out_default**
6: **in2out_default**
7: wb_clk_i
8: V_Clk
9: COMB
10: INPUTS
11: OUTPUTS

-------------------------------------------------------------------------------------------------------------------------------------------------------------
PATHGROUP QOR 
-------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV
    1   1   0.0000     0.0000      0   0.0000     0.0000      0
    1   2   0.0000     0.0000      0   0.0000     0.0000      0
    1   3   0.0000     0.0000      0   0.0000     0.0000      0
    1   4   0.0000     0.0000      0   0.0000     0.0000      0
    1   5   0.0000     0.0000      0   0.0000     0.0000      0
    1   6   0.0000     0.0000      0   0.0000     0.0000      0
    1   7   0.0000     0.0000      0   0.0000     0.0000      0
    1   8   0.0000     0.0000      0   0.0000     0.0000      0
    1   9   0.0000     0.0000      0   0.0000     0.0000      0
    1  10   0.0000     0.0000      0   0.0000     0.0000      0
    1  11   0.0000     0.0000      0   0.0000     0.0000      0
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
SCENARIO QOR 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage
    1   *   0.0000     0.0000   0.0000      0   0.0000     0.0000      0        0     0.0000        0 8095663.00
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
DESIGN QOR 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage         Area    InstCnt
    *   *   0.0000     0.0000   0.0000      0   0.0000     0.0000      0        0     0.0000        0 8095663.00     12412.11        781
----------------------------------------------------------------------------------------------------------------------------------------------------------------------

Route-opt initial QoR Summary       WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV  MaxCapV    Leakage         Area    InstCnt
Route-opt initial QoR Summary    0.0000     0.0000   0.0000      0   0.0000     0.0000      0        0        0 8095663.00     12412.11        781
Information: The netlist change observers are disabled for incremental extraction. (TIM-126)
INFO: using 1 threads
Route-opt initialization complete         CPU:   915 s (  0.25 hr )  ELAPSE:  4289 s (  1.19 hr )  MEM-PEAK:   878 MB
Information: Initializing classic cellmap without advanced rules enabled and with PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Information: Creating classic rule checker.
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 587 total shapes.
Layer M2: cached 0 shapes out of 3872 total shapes.
Cached 0 vias out of 5557 total vias.
Total 0.0800 seconds to build cellmap data
INFO: creating 16(r) x 17(c) GridCells YDim 8.64 XDim 8.64
INFO: number of GridCells (0xa0cd8500): 272
INFO: creating 16(r) x 17(c) GridCells YDim 8.64 XDim 8.64
INFO: number of GridCells (0xa0cd8500): 272
Total 0.2100 seconds to load 4141 cell instances into cellmap, 55 cells are off site row
Moveable cells: 4136; Application fixed cells: 5; Macro cells: 0; User fixed cells: 0
790 out of 873 data nets are detail routed, 6 out of 6 clock nets are detail routed and total 879 nets have been analyzed
Estimated current stage is after clock and data detail route stage
Average cell width 1.3004, cell height 2.8800, cell area 3.7452 for total 4141 placed and application fixed cells
Route-opt optimization summary            SETUP-COST    R2R-COST HOLD-COST LDRC-COST          AREA     LEAKAGE     INSTCNT            ELAPSE       MEM
Warning: Total 81 nets have their routing open (data: 81 nets, clock: 0 nets). This will cause problems for extraction, timing and post-route optimization. Some examples of open nets are listed below. (ROPT-004)
  N43
  N45
  N121
  n65
  prer[14]
  prer[5]
  ctr[7]
  cr[5]
  byte_controller/net_PTECO_HOLD_NET46
  byte_controller/N105
Warning: Cannot find any max transition constraint on the design. (OPT-070)
INFO: place.legalize.enable_advanced_legalizer not set - need to revert CLO


INFO: New Levelizer turned on
Route-opt optimization Phase 2 Iter  1          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 2 Iter  2          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878


Route-opt optimization Phase 4 Iter  1          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 4 Iter  2          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 4 Iter  3          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 4 Iter  4          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 4 Iter  5          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 4 Iter  6          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 4 Iter  7          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 4 Iter  8          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878

Route-opt optimization Phase 5 Iter  1          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter  2          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter  3          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter  4          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter  5          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter  6          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter  7          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter  8          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter  9          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter 10          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter 11          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter 12          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter 13          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
Route-opt optimization Phase 5 Iter 14          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878

Route-opt optimization Phase 6 Iter  1          0.00        0.00      0.00         0      12412.11  8095663.00         781              1.19       878
INFO: New Levelizer turned on

Route-opt optimization Phase 7 Iter  1          0.00        0.00      0.00         0      11739.34  7309656.50         781              1.19       878
Warning: Design includes unreasonable large hold violation(s). (OPT-209)
Route-opt optimization Phase 7 Iter  2          0.00        0.00      0.00         0      11739.34  7309656.50         781              1.19       878
Warning: Design includes unreasonable large hold violation(s). (OPT-209)
INFO: updating slack distrubution time borrowing
updateTimeBorrowsAndSi elapsed: 0.523000


Route-opt optimization summary            SETUP-COST    R2R-COST HOLD-COST LDRC-COST          AREA     LEAKAGE     INSTCNT            ELAPSE       MEM
Route-opt route preserve complete         CPU:   919 s (  0.26 hr )  ELAPSE:  4292 s (  1.19 hr )  MEM-PEAK:   878 MB

INFO: Sending timing info to router
Information: Serialized np data
INFO: timer data saved to /tmp/routing_20076_598113152.timdat
Information: The netlist change observers are enabled for incremental extraction. (TIM-127)
nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 587 total shapes.
Layer M2: cached 0 shapes out of 3872 total shapes.
Cached 0 vias out of 5557 total vias.

Legalizing Top Level Design i2c_master_top ... 
Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0300 seconds to build cellmap data
Information: Creating classic rule checker.
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
=====> Processed 44 ref cells (0 fillers) from library

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
       14094         4141        Yes DEFAULT_VA

Warning: max_legality_failures=5000 ignored.
        To use it, set limit_legality_checks to true.
Warning: max_legality_check_range=500 ignored.
        To use it, set limit_legality_checks to true.
Starting legalizer.
Warning: Density is 100.0%
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
Warning: Density is 100.0%
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (1 sec)
Legalization complete (1 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                   4141
number of references:                44
number of site rows:                 41
number of locations attempted:    96341
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

Warning: There were 241 cells for which the legalizer could not find a legal placement:
 U111
 U133
 byte_controller/U51
 byte_controller/bit_controller/U55
 byte_controller/bit_controller/sub_260/U13
 U48
 byte_controller/U65
 U74
 byte_controller/bit_controller/U115
 byte_controller/bit_controller/U175
...
number of cells aggregated:        3895 (15233 total sites)
avg row height over cells:        2.880 um
rms cell displacement:            3.354 um ( 1.16 row height)
rms weighted cell displacement:   3.354 um ( 1.16 row height)
max cell displacement:           15.393 um ( 5.34 row height)
avg cell displacement:            2.583 um ( 0.90 row height)
avg weighted cell displacement:   2.583 um ( 0.90 row height)
number of cells moved:             3737
number of large displacements:      458
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: xofiller!SHFILL1!x189600y964000 (SHFILL1)
  Input location: (18.96,96.4)
  Legal location: (24.4,110.8)
  Displacement:  15.393 um ( 5.34 row height)
Cell: xofiller!SHFILL1!x237600y820000 (SHFILL1)
  Input location: (23.76,82)
  Legal location: (21.52,96.4)
  Displacement:  14.573 um ( 5.06 row height)
Cell: xofiller!SHFILL1!x180000y877600 (SHFILL1)
  Input location: (18,87.76)
  Legal location: (20.24,102.16)
  Displacement:  14.573 um ( 5.06 row height)
Cell: xofiller!SHFILL1!x176800y877600 (SHFILL1)
  Input location: (17.68,87.76)
  Legal location: (19.6,102.16)
  Displacement:  14.527 um ( 5.04 row height)
Cell: xofiller!SHFILL1!x173600y877600 (SHFILL1)
  Input location: (17.36,87.76)
  Legal location: (18.96,102.16)
  Displacement:  14.489 um ( 5.03 row height)
Cell: xofiller!SHFILL1!x237600y848800 (SHFILL1)
  Input location: (23.76,84.88)
  Legal location: (25.04,99.28)
  Displacement:  14.457 um ( 5.02 row height)
Cell: xofiller!SHFILL1!x183200y964000 (SHFILL1)
  Input location: (18.32,96.4)
  Legal location: (19.28,110.8)
  Displacement:  14.432 um ( 5.01 row height)
Cell: xofiller!SHFILL1!x180000y964000 (SHFILL1)
  Input location: (18,96.4)
  Legal location: (18.96,110.8)
  Displacement:  14.432 um ( 5.01 row height)
Cell: xofiller!SHFILL1!x186400y964000 (SHFILL1)
  Input location: (18.64,96.4)
  Legal location: (19.6,110.8)
  Displacement:  14.432 um ( 5.01 row height)
Cell: xofiller!SHFILL1!x468000y733600 (SHFILL1)
  Input location: (46.8,73.36)
  Legal location: (47.44,87.76)
  Displacement:  14.414 um ( 5.00 row height)

Warning: Some cells could not be placed.
Warning: Perform NDM update as "place.legalize.always_continue" is set to true
Information: Extraction observers are detached as design net change threshold is reached.
Legalization failed.
Total Legalizer CPU: 1.614
Total Legalizer Wall Time: 1.615
----------------------------------------------------------------

Route-opt legalization complete           CPU:   921 s (  0.26 hr )  ELAPSE:  4294 s (  1.19 hr )  MEM-PEAK:   878 MB
INFO: Router Max Iterations set to : 5 
Warning: Cell contains tie connections which are not connected to real PG. (ZRT-511)
Warning: Ignore contact DIFFCON. (ZRT-015)
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M9
Found antenna rule mode 4, diode mode 2:
        layer M1:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M2:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M3:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M4:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M5:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M6:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M7:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M8:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M9:  max ratio 1000, diode ratio {0.06 0 8000 50000} 
        layer CO: , diode ratio {0 0 1 0 0} 
        layer VIA1:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA2:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA3:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA4:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA5:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA6:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA7:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA8:  max ratio 20, diode ratio {0.06 0 210 900} 
Information: Option route.detail.force_end_on_preferred_grid will be ignored since none of the layers have preferred grid. (ZRT-703)
Warning: Port GVDD of cell routing
        is unplaced.  This may impact routing result. (ZRT-740)
Warning: Port GVSS of cell routing
        is unplaced.  This may impact routing result. (ZRT-740)
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Information: Via ladder engine would be activated for pattern must join connection in certain commands. Please refer to man-page for the command list. (ZRT-619)
Warning: Contact VIA89's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 default pitch 0.320 may be too small to handle up/down via. Note, that minimum requirements are "wire/via-down 0.315" & "wire/via-up 0.330". (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 default pitch 0.320 may be too small to handle up/down via. Note, that minimum requirements are "wire/via-down 0.360" & "wire/via-up 0.320". (ZRT-026)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 7.50 outside the layer range. (ZRT-707)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 7.50 outside the layer range on clock nets. (ZRT-718)
Information: When applicable layer based tapering will taper up to 0.00 in distance from the pin. (ZRT-706)
Warning: Cell U74 is placed overlapping with other cells at {{14.160 10.000} {18.320 12.880}}. (ZRT-763)
Warning: Cell byte_controller/U64 is placed overlapping with other cells at {{106.960 18.640} {112.080 21.520}}. (ZRT-763)
Warning: Cell byte_controller/U36 is placed overlapping with other cells at {{62.160 87.760} {66.320 90.640}}. (ZRT-763)
Warning: Cell byte_controller/bit_controller/cmd_ack_reg is placed overlapping with other cells at {{81.360 93.520} {92.560 96.400}}. (ZRT-763)
[ECO: DbIn With Extraction] Elapsed real time: 0:00:00 
[ECO: DbIn With Extraction] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[ECO: DbIn With Extraction] Stage (MB): Used   15  Alloctr   15  Proc    0 
[ECO: DbIn With Extraction] Total (MB): Used   19  Alloctr   20  Proc 5493 
[ECO: Before Refresh Via Ladder Phase] Elapsed real time: 0:00:00 
[ECO: Before Refresh Via Ladder Phase] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[ECO: Before Refresh Via Ladder Phase] Stage (MB): Used   15  Alloctr   15  Proc    0 
[ECO: Before Refresh Via Ladder Phase] Total (MB): Used   19  Alloctr   20  Proc 5493 

    Found 0 via ladders to verify.

VIA LADDER INFO: found 0 via ladder DRCs across 0 nets.
Updating the database ...

    Via ladders will be inserted on 0 of 0 ports with via ladder constraints.

Updating the database ...
[ECO: After Refresh Via Ladder Phase] Elapsed real time: 0:00:00 
[ECO: After Refresh Via Ladder Phase] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[ECO: After Refresh Via Ladder Phase] Stage (MB): Used   16  Alloctr   16  Proc    0 
[ECO: After Refresh Via Ladder Phase] Total (MB): Used   19  Alloctr   20  Proc 5493 
Warning: Power net GVDD has no power preroutes, skip tie-off. (ZRT-101)
Warning: Power net GVSS has no power preroutes, skip tie-off. (ZRT-101)
[ECO: Analysis] Elapsed real time: 0:00:00 
[ECO: Analysis] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[ECO: Analysis] Stage (MB): Used   16  Alloctr   16  Proc    0 
[ECO: Analysis] Total (MB): Used   19  Alloctr   20  Proc 5493 
Num of eco nets = 879
Num of open eco nets = 838
[ECO: Init] Elapsed real time: 0:00:00 
[ECO: Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[ECO: Init] Stage (MB): Used   16  Alloctr   16  Proc    0 
[ECO: Init] Total (MB): Used   19  Alloctr   20  Proc 5493 
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used   24  Alloctr   24  Proc 5493 
Printing options for 'route.common.*'
common.eco_route_fix_existing_drc                       :        true                
common.verbose_level                                    :        0                   

Printing options for 'route.global.*'

Begin global routing.
Loading parastics information to the router ...
parastics information loaded to the router.
[End of Loading Timing] Elapsed real time: 0:00:00 
[End of Loading Timing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00um,0.00um,139.36um,138.08um)
Number of routing layers = 9
layer M1, dir Hor, min width = 0.14um, min space = 0.14um pitch = 0.32um
layer M2, dir Ver, min width = 0.16um, min space = 0.16um pitch = 0.32um
layer M3, dir Hor, min width = 0.16um, min space = 0.16um pitch = 0.64um
layer M4, dir Ver, min width = 0.16um, min space = 0.16um pitch = 0.64um
layer M5, dir Hor, min width = 0.16um, min space = 0.16um pitch = 1.28um
layer M6, dir Ver, min width = 0.16um, min space = 0.16um pitch = 1.28um
layer M7, dir Hor, min width = 0.16um, min space = 0.16um pitch = 2.56um
layer M8, dir Ver, min width = 0.16um, min space = 0.16um pitch = 3.84um
layer M9, dir Hor, min width = 0.45um, min space = 0.45um pitch = 5.12um
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    1  Alloctr    1  Proc    0 
[End of Build Tech Data] Total (MB): Used   29  Alloctr   29  Proc 5493 
Warning: Power net GVSS has no power preroutes, skip tie-off. (ZRT-101)
Warning: No existing global route is available for reuse in incremental global routing. (ZRT-586)
Net statistics:
Total number of nets     = 881
Number of nets to route  = 838
Number of single or zero port nets = 2
Number of nets with min-layer-mode soft = 2
Number of nets with min-layer-mode soft-cost-medium = 2
Number of nets with max-layer-mode hard = 6
757 nets are partially connected,
 of which 757 are detail routed and 0 are global routed.
40 nets are fully connected,
 of which 40 are detail routed and 0 are global routed.
2 nets have non-default rule cts_w2_s2_vlg
         2 non-user-specified nets, 2 non-user-specified clock nets, 0 user-specified nets
Net length statistics: 
Net Count(Ignore Fully Rted) 838, Total Half Perimeter Wire Length (HPWL) 19666 microns
HPWL   0 ~   50 microns: Net Count      760     Total HPWL        12606 microns
HPWL  50 ~  100 microns: Net Count       47     Total HPWL         3172 microns
HPWL 100 ~  200 microns: Net Count       30     Total HPWL         3668 microns
HPWL 200 ~  300 microns: Net Count        1     Total HPWL          220 microns
HPWL 300 ~  400 microns: Net Count        0     Total HPWL            0 microns
HPWL 400 ~  500 microns: Net Count        0     Total HPWL            0 microns
HPWL 500 ~  600 microns: Net Count        0     Total HPWL            0 microns
HPWL 600 ~  700 microns: Net Count        0     Total HPWL            0 microns
HPWL 700 ~  800 microns: Net Count        0     Total HPWL            0 microns
HPWL 800 ~  900 microns: Net Count        0     Total HPWL            0 microns
HPWL 900 ~ 1000 microns: Net Count        0     Total HPWL            0 microns
HPWL     > 1000 microns: Net Count        0     Total HPWL            0 microns
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   29  Alloctr   30  Proc 5493 
Number of partitions: 1 (1 x 1)
Size of partitions: 48 gCells x 47 gCells
Average gCell capacity  2.77     on layer (1)    M1
Average gCell capacity  9.04     on layer (2)    M2
Average gCell capacity  4.56     on layer (3)    M3
Average gCell capacity  4.50     on layer (4)    M4
Average gCell capacity  2.27     on layer (5)    M5
Average gCell capacity  2.25     on layer (6)    M6
Average gCell capacity  1.13     on layer (7)    M7
Average gCell capacity  0.75     on layer (8)    M8
Average gCell capacity  0.55     on layer (9)    M9
Average number of tracks per gCell 9.21  on layer (1)    M1
Average number of tracks per gCell 9.08  on layer (2)    M2
Average number of tracks per gCell 4.62  on layer (3)    M3
Average number of tracks per gCell 4.56  on layer (4)    M4
Average number of tracks per gCell 2.32  on layer (5)    M5
Average number of tracks per gCell 2.29  on layer (6)    M6
Average number of tracks per gCell 1.17  on layer (7)    M7
Average number of tracks per gCell 0.79  on layer (8)    M8
Average number of tracks per gCell 0.60  on layer (9)    M9
Number of gCells = 20304
Current Stage stats:
[End of Build Congestion Map] Elapsed real time: 0:00:00 
[End of Build Congestion Map] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Congestion Map] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Congestion Map] Total (MB): Used   30  Alloctr   30  Proc 5493 
Current Stage stats:
[End of Add Nets Demand] Elapsed real time: 0:00:00 
[End of Add Nets Demand] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Add Nets Demand] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Add Nets Demand] Total (MB): Used   30  Alloctr   30  Proc 5493 
Number of user frozen nets = 0
Information: RC layer preference is turned on for this design. (ZRT-613)
Total stats:
[End of Build Data] Elapsed real time: 0:00:00 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Data] Stage (MB): Used    2  Alloctr    2  Proc    0 
[End of Build Data] Total (MB): Used   30  Alloctr   30  Proc 5493 
Number of partitions: 1 (1 x 1)
Size of partitions: 48 gCells x 47 gCells
Current Stage stats:
[End of Blocked Pin Detection] Elapsed real time: 0:00:00 
[End of Blocked Pin Detection] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Blocked Pin Detection] Stage (MB): Used  176  Alloctr  176  Proc   64 
[End of Blocked Pin Detection] Total (MB): Used  206  Alloctr  206  Proc 5557 
Information: Using 1 threads for routing. (ZRT-444)
Information: Multiple gcell levels ON
Information: Buffer distance is estimated to be ~2254.0000um (782 gCells)

Start GR phase 0
Number of partitions: 1 (1 x 1)
Size of partitions: 48 gCells x 47 gCells
[rtAllBotParts] Elapsed real time: 0:00:00 
[rtAllBotParts] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[rtTop] Elapsed real time: 0:00:00 
[rtTop] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:00 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Initial Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Initial Routing] Total (MB): Used  206  Alloctr  207  Proc 5557 
Initial. Routing result:
Initial. Both Dirs: Dmd-Cap  =     0 Max = 1 GRCs =     3 (0.07%)
Initial. H routing: Dmd-Cap  =     0 Max = 1 (GRCs =  1) GRCs =     1 (0.04%)
Initial. V routing: Dmd-Cap  =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.09%)
Initial. Both Dirs: Overflow =   123 Max = 8 GRCs =   125 (2.77%)
Initial. H routing: Overflow =    33 Max = 2 (GRCs =  7) GRCs =    72 (3.19%)
Initial. V routing: Overflow =    89 Max = 8 (GRCs =  1) GRCs =    53 (2.35%)
Initial. M1         Overflow =    18 Max = 2 (GRCs =  1) GRCs =    18 (0.80%)
Initial. M2         Overflow =    89 Max = 8 (GRCs =  1) GRCs =    53 (2.35%)
Initial. M3         Overflow =    14 Max = 2 (GRCs =  6) GRCs =    54 (2.39%)
Initial. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 4502.22
Initial. Layer M1 wire length = 148.53
Initial. Layer M2 wire length = 2374.65
Initial. Layer M3 wire length = 1931.01
Initial. Layer M4 wire length = 32.83
Initial. Layer M5 wire length = 15.20
Initial. Layer M6 wire length = 0.00
Initial. Layer M7 wire length = 0.00
Initial. Layer M8 wire length = 0.00
Initial. Layer M9 wire length = 0.00
Initial. Total Number of Contacts = 2577
Initial. Via VIA12C count = 1499
Initial. Via VIA23C count = 1057
Initial. Via VIA34C count = 16
Initial. Via VIA45C count = 5
Initial. Via VIA56C count = 0
Initial. Via VIA67C count = 0
Initial. Via VIA78C count = 0
Initial. Via VIA89C count = 0
Initial. completed.

Start GR phase 1
Thu May 16 11:35:48 2024
Number of partitions: 1 (1 x 1)
Size of partitions: 48 gCells x 47 gCells
[rtAllParts] Elapsed real time: 0:00:00 
[rtAllParts] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used  206  Alloctr  207  Proc 5557 
phase1. Routing result:
phase1. Both Dirs: Dmd-Cap  =     0 Max = 1 GRCs =     3 (0.07%)
phase1. H routing: Dmd-Cap  =     0 Max = 1 (GRCs =  1) GRCs =     1 (0.04%)
phase1. V routing: Dmd-Cap  =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.09%)
phase1. Both Dirs: Overflow =   112 Max = 8 GRCs =   106 (2.35%)
phase1. H routing: Overflow =    22 Max = 2 (GRCs =  3) GRCs =    53 (2.35%)
phase1. V routing: Overflow =    90 Max = 8 (GRCs =  1) GRCs =    53 (2.35%)
phase1. M1         Overflow =    17 Max = 2 (GRCs =  1) GRCs =    17 (0.75%)
phase1. M2         Overflow =    90 Max = 8 (GRCs =  1) GRCs =    53 (2.35%)
phase1. M3         Overflow =     5 Max = 2 (GRCs =  2) GRCs =    36 (1.60%)
phase1. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 4595.38
phase1. Layer M1 wire length = 147.16
phase1. Layer M2 wire length = 2476.53
phase1. Layer M3 wire length = 1913.55
phase1. Layer M4 wire length = 39.13
phase1. Layer M5 wire length = 19.01
phase1. Layer M6 wire length = 0.00
phase1. Layer M7 wire length = 0.00
phase1. Layer M8 wire length = 0.00
phase1. Layer M9 wire length = 0.00
phase1. Total Number of Contacts = 2586
phase1. Via VIA12C count = 1499
phase1. Via VIA23C count = 1057
phase1. Via VIA34C count = 22
phase1. Via VIA45C count = 8
phase1. Via VIA56C count = 0
phase1. Via VIA67C count = 0
phase1. Via VIA78C count = 0
phase1. Via VIA89C count = 0
phase1. completed.

Start GR phase 2
Thu May 16 11:35:49 2024
Number of partitions: 1 (1 x 1)
Size of partitions: 48 gCells x 47 gCells
[rtAllParts] Elapsed real time: 0:00:00 
[rtAllParts] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
Current Stage stats:
[End of Phase2 Routing] Elapsed real time: 0:00:00 
[End of Phase2 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase2 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase2 Routing] Total (MB): Used  206  Alloctr  207  Proc 5557 
phase2. Routing result:
phase2. Both Dirs: Dmd-Cap  =     0 Max = 1 GRCs =     3 (0.07%)
phase2. H routing: Dmd-Cap  =     0 Max = 1 (GRCs =  1) GRCs =     1 (0.04%)
phase2. V routing: Dmd-Cap  =     0 Max = 1 (GRCs =  2) GRCs =     2 (0.09%)
phase2. Both Dirs: Overflow =   112 Max = 8 GRCs =    98 (2.17%)
phase2. H routing: Overflow =    22 Max = 2 (GRCs =  3) GRCs =    45 (1.99%)
phase2. V routing: Overflow =    90 Max = 8 (GRCs =  1) GRCs =    53 (2.35%)
phase2. M1         Overflow =    17 Max = 2 (GRCs =  1) GRCs =    17 (0.75%)
phase2. M2         Overflow =    90 Max = 8 (GRCs =  1) GRCs =    53 (2.35%)
phase2. M3         Overflow =     5 Max = 2 (GRCs =  2) GRCs =    28 (1.24%)
phase2. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase2. Total Wire Length = 4636.06
phase2. Layer M1 wire length = 147.16
phase2. Layer M2 wire length = 2499.94
phase2. Layer M3 wire length = 1910.24
phase2. Layer M4 wire length = 52.90
phase2. Layer M5 wire length = 25.83
phase2. Layer M6 wire length = 0.00
phase2. Layer M7 wire length = 0.00
phase2. Layer M8 wire length = 0.00
phase2. Layer M9 wire length = 0.00
phase2. Total Number of Contacts = 2601
phase2. Via VIA12C count = 1500
phase2. Via VIA23C count = 1059
phase2. Via VIA34C count = 31
phase2. Via VIA45C count = 11
phase2. Via VIA56C count = 0
phase2. Via VIA67C count = 0
phase2. Via VIA78C count = 0
phase2. Via VIA89C count = 0
phase2. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:00 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Whole Chip Routing] Stage (MB): Used  178  Alloctr  178  Proc   64 
[End of Whole Chip Routing] Total (MB): Used  206  Alloctr  207  Proc 5557 

Congestion utilization per direction:
Average vertical track utilization   = 19.75 %
Peak    vertical track utilization   = 106.67 %
Average horizontal track utilization = 20.30 %
Peak    horizontal track utilization = 114.29 %

[End of Global Routing] Elapsed real time: 0:00:00 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Global Routing] Stage (MB): Used  178  Alloctr  178  Proc   64 
[End of Global Routing] Total (MB): Used  206  Alloctr  206  Proc 5557 
Updating congestion ...
Updating congestion ...
[End of dbOut] Elapsed real time: 0:00:00 
[End of dbOut] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of dbOut] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of dbOut] Total (MB): Used   56  Alloctr   57  Proc 5557 
[ECO: GR] Elapsed real time: 0:00:01 
[ECO: GR] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[ECO: GR] Stage (MB): Used   37  Alloctr   37  Proc   64 
[ECO: GR] Total (MB): Used   56  Alloctr   57  Proc 5557 

Start track assignment

Printing options for 'route.common.*'
common.eco_route_fix_existing_drc                       :        true                
common.verbose_level                                    :        0                   

Printing options for 'route.track.*'

Information: Using 1 threads for routing. (ZRT-444)
Information: RC layer preference is turned on for this design. (ZRT-613)

[Track Assign: TA init] Elapsed real time: 0:00:00 
[Track Assign: TA init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Track Assign: TA init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Track Assign: TA init] Total (MB): Used   20  Alloctr   21  Proc 5557 

Start initial assignment

Assign Horizontal partitions, iteration 0 
Routed partition 1/12       
Routed partition 2/12       
Routed partition 3/12       
Routed partition 4/12       
Routed partition 5/12       
Routed partition 6/12       
Routed partition 7/12       
Routed partition 8/12       
Routed partition 9/12       
Routed partition 10/12      
Routed partition 11/12      
Routed partition 12/12      

Assign Vertical partitions, iteration 0 
Routed partition 1/12       
Routed partition 2/12       
Routed partition 3/12       
Routed partition 4/12       
Routed partition 5/12       
Routed partition 6/12       
Routed partition 7/12       
Routed partition 8/12       
Routed partition 9/12       
Routed partition 10/12      
Routed partition 11/12      
Routed partition 12/12      

Number of wires with overlap after iteration 0 = 3697 of 7193


[Track Assign: Iteration 0] Elapsed real time: 0:00:00 
[Track Assign: Iteration 0] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[Track Assign: Iteration 0] Stage (MB): Used    1  Alloctr    1  Proc    0 
[Track Assign: Iteration 0] Total (MB): Used   21  Alloctr   22  Proc 5557 

Reroute to fix overlaps (iter = 1)

Assign Horizontal partitions, iteration 1 
Routed partition 1/12       
Routed partition 2/12       
Routed partition 3/12       
Routed partition 4/12       
Routed partition 5/12       
Routed partition 6/12       
Routed partition 7/12       
Routed partition 8/12       
Routed partition 9/12       
Routed partition 10/12      
Routed partition 11/12      
Routed partition 12/12      

Assign Vertical partitions, iteration 1 
Routed partition 1/12       
Routed partition 2/12       
Routed partition 3/12       
Routed partition 4/12       
Routed partition 5/12       
Routed partition 6/12       
Routed partition 7/12       
Routed partition 8/12       
Routed partition 9/12       
Routed partition 10/12      
Routed partition 11/12      
Routed partition 12/12      

[Track Assign: Iteration 1] Elapsed real time: 0:00:01 
[Track Assign: Iteration 1] Elapsed cpu  time: sys=0:00:00 usr=0:00:02 total=0:00:02
[Track Assign: Iteration 1] Stage (MB): Used    1  Alloctr    1  Proc    0 
[Track Assign: Iteration 1] Total (MB): Used   21  Alloctr   22  Proc 5557 

Number of wires with overlap after iteration 1 = 2048 of 5276


Wire length and via report:
---------------------------
Number of M1 wires: 978                  POLYCON: 0
Number of M2 wires: 2721                 VIA12C: 2414
Number of M3 wires: 1468                 VIA23C: 2328
Number of M4 wires: 84           VIA34C: 159
Number of M5 wires: 25           VIA45C: 43
Number of M6 wires: 0            VIA56C: 0
Number of M7 wires: 0            VIA67C: 0
Number of M8 wires: 0            VIA78C: 0
Number of M9 wires: 0            VIA89C: 0
Total number of wires: 5276              vias: 4944

Total M1 wire length: 620.9
Total M2 wire length: 3288.3
Total M3 wire length: 2687.1
Total M4 wire length: 257.5
Total M5 wire length: 195.0
Total M6 wire length: 0.0
Total M7 wire length: 0.0
Total M8 wire length: 0.0
Total M9 wire length: 0.0
Total wire length: 7048.8

Longest M1 wire length: 5.8
Longest M2 wire length: 34.6
Longest M3 wire length: 38.1
Longest M4 wire length: 19.2
Longest M5 wire length: 63.4
Longest M6 wire length: 0.0
Longest M7 wire length: 0.0
Longest M8 wire length: 0.0
Longest M9 wire length: 0.0


[Track Assign: Done] Elapsed real time: 0:00:01 
[Track Assign: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:02 total=0:00:02
[Track Assign: Done] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Track Assign: Done] Total (MB): Used   20  Alloctr   21  Proc 5557 
[ECO: CDR] Elapsed real time: 0:00:03 
[ECO: CDR] Elapsed cpu  time: sys=0:00:00 usr=0:00:03 total=0:00:04
[ECO: CDR] Stage (MB): Used   16  Alloctr   17  Proc   64 
[ECO: CDR] Total (MB): Used   20  Alloctr   21  Proc 5557 
Printing options for 'route.common.*'
common.eco_route_fix_existing_drc                       :        true                
common.verbose_level                                    :        0                   

Printing options for 'route.detail.*'
detail.antenna                                          :        true                
detail.eco_route_use_soft_spacing_for_timing_optimization:       false               

Printing options for 'route.auto_via_ladder.*'

Information: RC layer preference is turned on for this design. (ZRT-613)
Total number of nets = 881, of which 0 are not extracted
Total number of open nets = 0, of which 0 are frozen
Information: Using 1 threads for routing. (ZRT-444)
*****Start reporting antenna related parameters*****
  Antenna/diode mode:
    Antenna mode 4; diode mode 2
      Metal lay (M1)0; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA1)1; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M2)1; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA2)2; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M3)2; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA3)3; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M4)3; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA4)4; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M5)4; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA5)5; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M6)5; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA6)6; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M7)6; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA7)7; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M8)7; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA8)8; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M9)8; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 8000.000 50000.000 0.000)
  Top lay antenna ratio fix threshold == -1
  Antenna max pin count threshold == -1
  Check PG net == false
  MergeGate == true
  Break antenna to port mode == float
  Break antenna to macro pin mode == normal
*****End reporting antenna related parameters*****
Warning: Skipping antenna analysis for net wb_clk_i. The pin wb_clk_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_rst_i. The pin wb_rst_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net arst_i. The pin arst_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_adr_i[2]. The pin wb_adr_i[2] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_adr_i[1]. The pin wb_adr_i[1] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_adr_i[0]. The pin wb_adr_i[0] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[7]. The pin wb_dat_i[7] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[6]. The pin wb_dat_i[6] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[5]. The pin wb_dat_i[5] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[4]. The pin wb_dat_i[4] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[3]. The pin wb_dat_i[3] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[2]. The pin wb_dat_i[2] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[1]. The pin wb_dat_i[1] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[0]. The pin wb_dat_i[0] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_we_i. The pin wb_we_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_stb_i. The pin wb_stb_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_cyc_i. The pin wb_cyc_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net scl_pad_i. The pin scl_pad_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net sda_pad_i. The pin sda_pad_i on cell routing does not have enough gate area information. (ZRT-311)
Skipping antenna analysis for 19 nets as they don't have enough gate area info.
Start DR iteration 0: uniform partition
Routed  1/25 Partitions, Violations =   60
Routed  2/25 Partitions, Violations =   60
Routed  3/25 Partitions, Violations =   147
Routed  4/25 Partitions, Violations =   207
Routed  5/25 Partitions, Violations =   197
Routed  6/25 Partitions, Violations =   192
Routed  7/25 Partitions, Violations =   216
Routed  8/25 Partitions, Violations =   294
Routed  9/25 Partitions, Violations =   376
Routed  10/25 Partitions, Violations =  381
Routed  11/25 Partitions, Violations =  434
Routed  12/25 Partitions, Violations =  501
Routed  13/25 Partitions, Violations =  622
Routed  14/25 Partitions, Violations =  644
Routed  15/25 Partitions, Violations =  637
Routed  16/25 Partitions, Violations =  692
Routed  17/25 Partitions, Violations =  686
Routed  18/25 Partitions, Violations =  709
Routed  19/25 Partitions, Violations =  716
Routed  20/25 Partitions, Violations =  727
Routed  21/25 Partitions, Violations =  716
Routed  22/25 Partitions, Violations =  697
Routed  23/25 Partitions, Violations =  693
Routed  24/25 Partitions, Violations =  703
Routed  25/25 Partitions, Violations =  684

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      684
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 280
        Diff net via-cut spacing : 1
        Less than minimum area : 4
        Less than minimum width : 1
        Same net spacing : 19
        Short : 379

[Iter 0] Elapsed real time: 0:00:06 
[Iter 0] Elapsed cpu  time: sys=0:00:00 usr=0:00:06 total=0:00:06
[Iter 0] Stage (MB): Used   71  Alloctr   71  Proc    9 
[Iter 0] Total (MB): Used   91  Alloctr   92  Proc 5566 

End DR iteration 0 with 25 parts

Start DR iteration 1: non-uniform partition
Routed  1/36 Partitions, Violations =   664
Routed  2/36 Partitions, Violations =   666
Routed  3/36 Partitions, Violations =   666
Routed  4/36 Partitions, Violations =   666
Routed  5/36 Partitions, Violations =   675
Routed  6/36 Partitions, Violations =   681
Routed  7/36 Partitions, Violations =   665
Routed  8/36 Partitions, Violations =   650
Routed  9/36 Partitions, Violations =   642
Routed  10/36 Partitions, Violations =  630
Routed  11/36 Partitions, Violations =  613
Routed  12/36 Partitions, Violations =  618
Routed  13/36 Partitions, Violations =  613
Routed  14/36 Partitions, Violations =  610
Routed  15/36 Partitions, Violations =  622
Routed  16/36 Partitions, Violations =  584
Routed  17/36 Partitions, Violations =  581
Routed  18/36 Partitions, Violations =  581
Routed  19/36 Partitions, Violations =  579
Routed  20/36 Partitions, Violations =  579
Routed  21/36 Partitions, Violations =  579
Routed  22/36 Partitions, Violations =  581
Routed  23/36 Partitions, Violations =  536
Routed  24/36 Partitions, Violations =  510
Routed  25/36 Partitions, Violations =  496
Routed  26/36 Partitions, Violations =  491
Routed  27/36 Partitions, Violations =  470
Routed  28/36 Partitions, Violations =  473
Routed  29/36 Partitions, Violations =  471
Routed  30/36 Partitions, Violations =  469
Routed  31/36 Partitions, Violations =  468
Routed  32/36 Partitions, Violations =  462
Routed  33/36 Partitions, Violations =  455
Routed  34/36 Partitions, Violations =  451
Routed  35/36 Partitions, Violations =  451
Routed  36/36 Partitions, Violations =  444

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      444
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 164
        Diff net via-cut spacing : 1
        Less than minimum width : 3
        Same net spacing : 10
        Short : 266

[Iter 1] Elapsed real time: 0:00:09 
[Iter 1] Elapsed cpu  time: sys=0:00:00 usr=0:00:09 total=0:00:09
[Iter 1] Stage (MB): Used   71  Alloctr   71  Proc    9 
[Iter 1] Total (MB): Used   91  Alloctr   92  Proc 5566 

End DR iteration 1 with 36 parts

Start DR iteration 2: non-uniform partition
Routed  1/22 Partitions, Violations =   442
Routed  2/22 Partitions, Violations =   442
Routed  3/22 Partitions, Violations =   438
Routed  4/22 Partitions, Violations =   444
Routed  5/22 Partitions, Violations =   444
Routed  6/22 Partitions, Violations =   431
Routed  7/22 Partitions, Violations =   427
Routed  8/22 Partitions, Violations =   411
Routed  9/22 Partitions, Violations =   430
Routed  10/22 Partitions, Violations =  430
Routed  11/22 Partitions, Violations =  420
Routed  12/22 Partitions, Violations =  420
Routed  13/22 Partitions, Violations =  421
Routed  14/22 Partitions, Violations =  421
Routed  15/22 Partitions, Violations =  410
Routed  16/22 Partitions, Violations =  405
Routed  17/22 Partitions, Violations =  402
Routed  18/22 Partitions, Violations =  402
Routed  19/22 Partitions, Violations =  394
Routed  20/22 Partitions, Violations =  395
Routed  21/22 Partitions, Violations =  402
Routed  22/22 Partitions, Violations =  402

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      402
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 171
        Diff net via-cut spacing : 1
        Less than minimum width : 2
        Same net spacing : 11
        Short : 217

[Iter 2] Elapsed real time: 0:00:13 
[Iter 2] Elapsed cpu  time: sys=0:00:00 usr=0:00:13 total=0:00:13
[Iter 2] Stage (MB): Used   71  Alloctr   71  Proc    9 
[Iter 2] Total (MB): Used   91  Alloctr   92  Proc 5566 

End DR iteration 2 with 22 parts

Start DR iteration 3: non-uniform partition
Routed  1/18 Partitions, Violations =   401
Routed  2/18 Partitions, Violations =   381
Routed  3/18 Partitions, Violations =   380
Routed  4/18 Partitions, Violations =   379
Routed  5/18 Partitions, Violations =   379
Routed  6/18 Partitions, Violations =   380
Routed  7/18 Partitions, Violations =   374
Routed  8/18 Partitions, Violations =   369
Routed  9/18 Partitions, Violations =   366
Routed  10/18 Partitions, Violations =  364
Routed  11/18 Partitions, Violations =  365
Routed  12/18 Partitions, Violations =  365
Routed  13/18 Partitions, Violations =  365
Routed  14/18 Partitions, Violations =  363
Routed  15/18 Partitions, Violations =  366
Routed  16/18 Partitions, Violations =  357
Routed  17/18 Partitions, Violations =  355
Routed  18/18 Partitions, Violations =  361

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      361
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 154
        Diff net via-cut spacing : 1
        Same net spacing : 7
        Short : 199

[Iter 3] Elapsed real time: 0:00:17 
[Iter 3] Elapsed cpu  time: sys=0:00:00 usr=0:00:17 total=0:00:17
[Iter 3] Stage (MB): Used   71  Alloctr   71  Proc    9 
[Iter 3] Total (MB): Used   91  Alloctr   92  Proc 5566 

End DR iteration 3 with 18 parts

Start DR iteration 4: non-uniform partition
Routed  1/17 Partitions, Violations =   367
Routed  2/17 Partitions, Violations =   373
Routed  3/17 Partitions, Violations =   377
Routed  4/17 Partitions, Violations =   383
Routed  5/17 Partitions, Violations =   389
Routed  6/17 Partitions, Violations =   389
Routed  7/17 Partitions, Violations =   388
Routed  8/17 Partitions, Violations =   389
Routed  9/17 Partitions, Violations =   391
Routed  10/17 Partitions, Violations =  391
Routed  11/17 Partitions, Violations =  400
Routed  12/17 Partitions, Violations =  401
Routed  13/17 Partitions, Violations =  386
Routed  14/17 Partitions, Violations =  386
Routed  15/17 Partitions, Violations =  384
Routed  16/17 Partitions, Violations =  386
Routed  17/17 Partitions, Violations =  390

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      390
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 148
        Diff net via-cut spacing : 1
        Less than minimum width : 1
        Same net spacing : 6
        Short : 234

[Iter 4] Elapsed real time: 0:00:22 
[Iter 4] Elapsed cpu  time: sys=0:00:00 usr=0:00:22 total=0:00:22
[Iter 4] Stage (MB): Used   71  Alloctr   71  Proc    9 
[Iter 4] Total (MB): Used   91  Alloctr   92  Proc 5566 

End DR iteration 4 with 17 parts

Incremental DRC patching:
Routed  1/19 Partitions, Violations =   390
Routed  2/19 Partitions, Violations =   390
Routed  3/19 Partitions, Violations =   390
Routed  4/19 Partitions, Violations =   390
Routed  5/19 Partitions, Violations =   390
Routed  6/19 Partitions, Violations =   390
Routed  7/19 Partitions, Violations =   392
Routed  8/19 Partitions, Violations =   390
Routed  9/19 Partitions, Violations =   386
Routed  10/19 Partitions, Violations =  386
Routed  11/19 Partitions, Violations =  386
Routed  12/19 Partitions, Violations =  387
Routed  13/19 Partitions, Violations =  387
Routed  14/19 Partitions, Violations =  390
Routed  15/19 Partitions, Violations =  392
Routed  16/19 Partitions, Violations =  392
Routed  17/19 Partitions, Violations =  389
Routed  18/19 Partitions, Violations =  385
Routed  19/19 Partitions, Violations =  385

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      385
        @@@@ Total number of instance ports with antenna violations =   0

        Diff net spacing : 146
        Diff net via-cut spacing : 1
        Less than minimum width : 1
        Same net spacing : 6
        Short : 231

        @@@@ Total nets not meeting constraints =       0

Stop DR since reached max number of iterations


Nets that have been changed:
Net 1 = byte_controller/bit_controller/net_PTECO_HOLD_NET55
Net 2 = byte_controller/tmp_net0
Net 3 = wb_rst_i
Net 4 = arst_i
Net 5 = wb_adr_i[2]
Net 6 = wb_adr_i[1]
Net 7 = wb_adr_i[0]
Net 8 = wb_dat_i[7]
Net 9 = wb_dat_i[6]
Net 10 = wb_dat_i[5]
Net 11 = wb_dat_i[4]
Net 12 = wb_dat_i[3]
Net 13 = wb_dat_i[2]
Net 14 = wb_dat_i[1]
Net 15 = wb_dat_i[0]
Net 16 = wb_dat_o[7]
Net 17 = wb_dat_o[6]
Net 18 = wb_dat_o[5]
Net 19 = wb_dat_o[4]
Net 20 = wb_dat_o[3]
Net 21 = wb_dat_o[1]
Net 22 = wb_dat_o[0]
Net 23 = wb_we_i
Net 24 = wb_ack_o
Net 25 = wb_inta_o
Net 26 = scl_padoen_o
Net 27 = sda_pad_i
Net 28 = sda_padoen_o
Net 29 = N20
Net 30 = sr_1
Net 31 = sr_0
Net 32 = N43
Net 33 = N44
Net 34 = N45
Net 35 = N46
Net 36 = N47
Net 37 = N48
Net 38 = N49
Net 39 = N50
Net 40 = done
Net 41 = i2c_al
Net 42 = irxack
Net 43 = N114
Net 44 = N115
Net 45 = N116
Net 46 = N117
Net 47 = N121
Net 48 = n5
Net 49 = n6
Net 50 = n7
Net 51 = n8
Net 52 = n9
Net 53 = n10
Net 54 = n11
Net 55 = n12
Net 56 = n13
Net 57 = n14
Net 58 = n15
Net 59 = n16
Net 60 = n18
Net 61 = n19
Net 62 = n200
Net 63 = n21
Net 64 = n22
Net 65 = n23
Net 66 = n24
Net 67 = n26
Net 68 = n27
Net 69 = n28
Net 70 = n29
Net 71 = n35
Net 72 = n36
Net 73 = n37
Net 74 = n38
Net 75 = n39
Net 76 = n40
Net 77 = n41
Net 78 = n42
Net 79 = n430
Net 80 = n440
Net 81 = n450
Net 82 = n460
Net 83 = n470
Net 84 = n480
Net 85 = n490
Net 86 = n500
Net 87 = n51
Net 88 = n52
Net 89 = n53
Net 90 = n54
Net 91 = n55
Net 92 = n56
Net 93 = n57
Net 94 = n58
Net 95 = n59
Net 96 = n60
Net 97 = n61
Net 98 = n62
Net 99 = n63
Net 100 = n64
.... and 760 other nets
Total number of changed nets = 860 (out of 881)

[DR: Done] Elapsed real time: 0:00:23 
[DR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:23 total=0:00:23
[DR: Done] Stage (MB): Used    0  Alloctr    0  Proc    9 
[DR: Done] Total (MB): Used   20  Alloctr   21  Proc 5566 
[ECO: DR] Elapsed real time: 0:00:26 
[ECO: DR] Elapsed cpu  time: sys=0:00:00 usr=0:00:27 total=0:00:27
[ECO: DR] Stage (MB): Used   16  Alloctr   17  Proc   73 
[ECO: DR] Total (MB): Used   20  Alloctr   21  Proc 5566 

ECO Route finished with 0 open nets, of which 0 are frozen
Information: Merged away 125 aligned/redundant DRCs. (ZRT-305)

ECO Route finished with 260 violations and 0 instance ports antenna violations

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      260
        Diff net spacing : 99
        Diff net via-cut spacing : 1
        Less than minimum width : 1
        Same net spacing : 5
        Short : 154



Total Wire Length =                    22757 micron
Total Number of Contacts =             6364
Total Number of Wires =                7537
Total Number of PtConns =              432
Total Number of Routed Wires =       7420
Total Routed Wire Length =           22636 micron
Total Number of Routed Contacts =       6364
        Layer          M1 :        664 micron
        Layer          M2 :       9603 micron
        Layer          M3 :       8777 micron
        Layer          M4 :       2227 micron
        Layer          M5 :       1365 micron
        Layer          M6 :          0 micron
        Layer          M7 :          0 micron
        Layer          M8 :          0 micron
        Layer          M9 :          0 micron
        Via        VIA45C :        132
        Via   VIA45C(rot) :          1
        Via   VIA34C(rot) :        433
        Via        VIA23C :       2896
        Via        VIA12C :         11
        Via   VIA12C(rot) :       2365
        Via        VIA12B :         39
        Via   VIA12B(rot) :        487

 
Redundant via conversion report:
--------------------------------

  Total optimized via conversion rate =  0.00% (0 / 6364 vias)
 
    Layer VIA1       =  0.00% (0      / 2902    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2902    vias)
    Layer VIA2       =  0.00% (0      / 2896    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2896    vias)
    Layer VIA3       =  0.00% (0      / 433     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (433     vias)
    Layer VIA4       =  0.00% (0      / 133     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (133     vias)
 
  Total double via conversion rate    =  0.00% (0 / 6364 vias)
 
    Layer VIA1       =  0.00% (0      / 2902    vias)
    Layer VIA2       =  0.00% (0      / 2896    vias)
    Layer VIA3       =  0.00% (0      / 433     vias)
    Layer VIA4       =  0.00% (0      / 133     vias)
 
  The optimized via conversion rate based on total routed via count =  0.00% (0 / 6364 vias)
 
    Layer VIA1       =  0.00% (0      / 2902    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2902    vias)
    Layer VIA2       =  0.00% (0      / 2896    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2896    vias)
    Layer VIA3       =  0.00% (0      / 433     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (433     vias)
    Layer VIA4       =  0.00% (0      / 133     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (133     vias)
 

Total number of nets = 881
0 open nets, of which 0 are frozen
Total number of excluded ports = 0 ports of 0 unplaced cells connected to 0 nets
                                 0 ports without pins of 0 cells connected to 0 nets
                                 0 ports of 0 cover cells connected to 0 non-pg nets
Total number of DRCs = 260
Total number of antenna violations = 0
Information: Routes in non-preferred voltage areas = 0 (ZRT-559)

Total Wire Length =                    22757 micron
Total Number of Contacts =             6364
Total Number of Wires =                7537
Total Number of PtConns =              432
Total Number of Routed Wires =       7420
Total Routed Wire Length =           22636 micron
Total Number of Routed Contacts =       6364
        Layer          M1 :        664 micron
        Layer          M2 :       9603 micron
        Layer          M3 :       8777 micron
        Layer          M4 :       2227 micron
        Layer          M5 :       1365 micron
        Layer          M6 :          0 micron
        Layer          M7 :          0 micron
        Layer          M8 :          0 micron
        Layer          M9 :          0 micron
        Via        VIA45C :        132
        Via   VIA45C(rot) :          1
        Via   VIA34C(rot) :        433
        Via        VIA23C :       2896
        Via        VIA12C :         11
        Via   VIA12C(rot) :       2365
        Via        VIA12B :         39
        Via   VIA12B(rot) :        487

 
Redundant via conversion report:
--------------------------------

  Total optimized via conversion rate =  0.00% (0 / 6364 vias)
 
    Layer VIA1       =  0.00% (0      / 2902    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2902    vias)
    Layer VIA2       =  0.00% (0      / 2896    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2896    vias)
    Layer VIA3       =  0.00% (0      / 433     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (433     vias)
    Layer VIA4       =  0.00% (0      / 133     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (133     vias)
 
  Total double via conversion rate    =  0.00% (0 / 6364 vias)
 
    Layer VIA1       =  0.00% (0      / 2902    vias)
    Layer VIA2       =  0.00% (0      / 2896    vias)
    Layer VIA3       =  0.00% (0      / 433     vias)
    Layer VIA4       =  0.00% (0      / 133     vias)
 
  The optimized via conversion rate based on total routed via count =  0.00% (0 / 6364 vias)
 
    Layer VIA1       =  0.00% (0      / 2902    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2902    vias)
    Layer VIA2       =  0.00% (0      / 2896    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2896    vias)
    Layer VIA3       =  0.00% (0      / 433     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (433     vias)
    Layer VIA4       =  0.00% (0      / 133     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (133     vias)
 
Topology ECO not run, no qualifying violations or in frozen nets.
Updating the database ...
...updated 860 nets with eco mode
[ECO: End] Elapsed real time: 0:00:26 
[ECO: End] Elapsed cpu  time: sys=0:00:00 usr=0:00:27 total=0:00:27
[ECO: End] Stage (MB): Used   -2  Alloctr   -2  Proc   73 
[ECO: End] Total (MB): Used    0  Alloctr    1  Proc 5566 

Route-opt ECO routing complete            CPU:   948 s (  0.26 hr )  ELAPSE:  4321 s (  1.20 hr )  MEM-PEAK:   951 MB
Co-efficient Ratio Summary:
4.193421605155  6.578038173730  2.479639287277  7.744187540401  0.485050000353  3.179565833784  5.567214754587  2.894454387461  6.565921217863  9.017937505874  3.903136100933  9.864670719691  6.078191064085
2.744208341123  8.318115604907  9.699225026083  2.464623950064  1.382370221226  9.387184029619  3.142429406669  0.968752789964  6.613180723294  4.146578793224  7.675814218112  2.192376313436  0.963702241094
2.700148443881  3.840450064440  3.750206053169  7.663458842299  6.212201167950  7.759678473967  7.862243056717  0.402387977150  0.032845095897  0.596111512371  4.500743696892  7.206376722909  8.278329498268
1.183725190997  3.334436408244  5.867609731622  7.173894385364  9.669819999761  7.591487347087  7.632106393266  7.679078063326  9.831314288630  1.878805817928  3.039538643539  1.227411247166  7.050428594780
2.403928173631  6.139852544054  4.100210066110  1.274718589655  4.570746653063  5.624878808820  7.826857253678  4.759133418263  5.409027926377  2.609823652834  0.425608838674  6.382817862759  9.187442122495
0.513656796621  5.027570618562  6.119813446103  6.181472312107  1.581675365776  7.486041822107  9.584562469756  2.041727387119  3.921160867338  0.650488682345  9.271914202409  3.369625504734  4.897189649020
6.860149244452  2.000104051691  9.095345907689  2.197041709512  0.915900067443  5.466092308426  8.142690055883  4.607193265224  8.244463794567  3.504870705451  1.312671662888  7.174506642592  9.939530808373
3.617852772683  8.946772637652  1.169969532707  4.529946656262  3.090979409795  5.580726136993  1.131397763510  0.721709625254  7.515947417690  0.649322209371  1.747996693513  5.812682590241  5.826708983342
Information: The net parasitics of block i2c_master_top are cleared. (TIM-123)
Information: The stitching and editing of coupling caps is turned OFF for design 'counter.dlib:routing.design'. (TIM-125)
Information: Design routing has 879 nets, 0 global routed, 877 detail routed. (NEX-024)
Information: The RC mode used is DR for design 'i2c_master_top'. (NEX-022)
---extraction options---
Corner: default
 late_cap_scale                : 1
 late_res_scale                : 1
 early_cap_scale               : 1
 early_res_scale               : 1
Global options:
 reference_direction       : use_from_tluplus
 real_metalfill_extraction : none
 virtual_shield_extraction : true
---app options---
 host.max_cores                   : 1
 extract.connect_open           : true
 extract.enable_coupling_cap    : false
Extracting design: routing 
Information: coupling capacitance is lumped to ground. (NEX-030)
Information: 877 nets are successfully extracted. (NEX-028)
Warning: Advanced receiver model has not been enabled for detailed routed design. (TIM-204)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 877, routed nets = 877, across physical hierarchy nets = 0, parasitics cached nets = 877, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)

Route-opt final QoR
___________________
Scenario Mapping Table
1: default

Pathgroup Mapping Table
1: **default**
2: **async_default**
3: **clock_gating_default**
4: **in2reg_default**
5: **reg2out_default**
6: **in2out_default**
7: wb_clk_i
8: V_Clk
9: COMB
10: INPUTS
11: OUTPUTS

-------------------------------------------------------------------------------------------------------------------------------------------------------------
PATHGROUP QOR 
-------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV
    1   1   0.0000     0.0000      0   0.0000     0.0000      0
    1   2   0.0000     0.0000      0   0.0000     0.0000      0
    1   3   0.0000     0.0000      0   0.0000     0.0000      0
    1   4   0.0000     0.0000      0   0.0000     0.0000      0
    1   5   0.0000     0.0000      0   0.0000     0.0000      0
    1   6   0.0000     0.0000      0   0.0000     0.0000      0
    1   7   0.0000     0.0000      0   0.0000     0.0000      0
    1   8   0.0000     0.0000      0   0.0000     0.0000      0
    1   9   0.0000     0.0000      0   0.0000     0.0000      0
    1  10   0.0000     0.0000      0   0.0000     0.0000      0
    1  11   0.0000     0.0000      0   0.0000     0.0000      0
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
SCENARIO QOR 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage
    1   *   0.0000     0.0000   0.0000      0   0.0000     0.0000      0        0     0.0000        0 7309656.50
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
DESIGN QOR 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage         Area    InstCnt
    *   *   0.0000     0.0000   0.0000      0   0.0000     0.0000      0        0     0.0000        0 7309656.50     11739.34        781
----------------------------------------------------------------------------------------------------------------------------------------------------------------------

Route-opt final QoR Summary         WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV  MaxCapV    Leakage         Area    InstCnt
Route-opt final QoR Summary      0.0000     0.0000   0.0000      0   0.0000     0.0000      0        0        0 7309656.50     11739.34        781

Route-opt optimization complete                 0.00        0.00      0.00         0      11739.34  7309656.50         781              1.20       951

Route-opt command complete                CPU:   949 s (  0.26 hr )  ELAPSE:  4321 s (  1.20 hr )  MEM-PEAK:   951 MB
Route-opt command statistics  CPU=48 sec (0.01 hr) ELAPSED=47 sec (0.01 hr) MEM-PEAK=0.929 GB
Information: Ending   'route_opt' (FLW-8001)
Information: Time: 2024-05-16 11:36:15 / Session:  01:12:01 / Command:  00:00:47 / CPU:  00:00:48 / Memory: 952 MB (FLW-8100)
0
icc2_shell> #Final Check
icc2_shell> check_routes
Warning: Cell contains tie connections which are not connected to real PG. (ZRT-511)
Warning: Ignore contact DIFFCON. (ZRT-015)
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M9
Found antenna rule mode 4, diode mode 2:
        layer M1:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M2:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M3:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M4:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M5:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M6:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M7:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M8:  max ratio 1000, diode ratio {0.06 0 456 43000} 
        layer M9:  max ratio 1000, diode ratio {0.06 0 8000 50000} 
        layer CO: , diode ratio {0 0 1 0 0} 
        layer VIA1:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA2:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA3:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA4:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA5:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA6:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA7:  max ratio 20, diode ratio {0.06 0 210 900} 
        layer VIA8:  max ratio 20, diode ratio {0.06 0 210 900} 
Information: Option route.detail.force_end_on_preferred_grid will be ignored since none of the layers have preferred grid. (ZRT-703)
Warning: Port GVDD of cell routing
        is unplaced.  This may impact routing result. (ZRT-740)
Warning: Port GVSS of cell routing
        is unplaced.  This may impact routing result. (ZRT-740)
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Information: Via ladder engine would be activated for pattern must join connection in certain commands. Please refer to man-page for the command list. (ZRT-619)
Warning: Contact VIA89's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 default pitch 0.320 may be too small to handle up/down via. Note, that minimum requirements are "wire/via-down 0.315" & "wire/via-up 0.330". (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 default pitch 0.320 may be too small to handle up/down via. Note, that minimum requirements are "wire/via-down 0.360" & "wire/via-up 0.320". (ZRT-026)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 11.25 outside the layer range. (ZRT-707)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 11.25 outside the layer range on clock nets. (ZRT-718)
Information: When applicable layer based tapering will taper up to 0.00 in distance from the pin. (ZRT-706)
Warning: Cell U74 is placed overlapping with other cells at {{14.160 10.000} {18.320 12.880}}. (ZRT-763)
Warning: Cell byte_controller/U64 is placed overlapping with other cells at {{106.960 18.640} {112.080 21.520}}. (ZRT-763)
Warning: Cell byte_controller/U36 is placed overlapping with other cells at {{62.160 87.760} {66.320 90.640}}. (ZRT-763)
Warning: Cell byte_controller/bit_controller/cmd_ack_reg is placed overlapping with other cells at {{81.360 93.520} {92.560 96.400}}. (ZRT-763)


Start checking for open nets ... 

Total number of nets = 881, of which 0 are not extracted
Total number of open nets = 0, of which 0 are frozen

Check 881 nets, 0 have Errors

[CHECK OPEN NETS] Elapsed real time: 0:00:00 
[CHECK OPEN NETS] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[CHECK OPEN NETS] Stage (MB): Used    0  Alloctr    0  Proc    0 
[CHECK OPEN NETS] Total (MB): Used   19  Alloctr   20  Proc 5566 
Printing options for 'route.common.*'
common.eco_route_fix_existing_drc                       :        true                
common.verbose_level                                    :        0                   

Printing options for 'route.detail.*'
detail.antenna                                          :        true                
detail.eco_route_use_soft_spacing_for_timing_optimization:       true                

Printing options for 'route.auto_via_ladder.*'

*****Start reporting antenna related parameters*****
  Antenna/diode mode:
    Antenna mode 4; diode mode 2
      Metal lay (M1)0; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA1)1; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M2)1; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA2)2; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M3)2; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA3)3; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M4)3; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA4)4; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M5)4; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA5)5; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M6)5; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA6)6; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M7)6; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA7)7; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M8)7; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 456.000 43000.000 0.000)
      Cut lay (VIA8)8; maxRatio 20.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 210.000 900.000 0.000)
      Metal lay (M9)8; maxRatio 1000.000 maxPRatio 2147483648.000 maxNRatio 2147483648.000; vector (0.060 0.000 8000.000 50000.000 0.000)
  Top lay antenna ratio fix threshold == -1
  Antenna max pin count threshold == -1
  Check PG net == false
  MergeGate == true
  Break antenna to port mode == float
  Break antenna to macro pin mode == normal
*****End reporting antenna related parameters*****
Warning: Skipping antenna analysis for net wb_clk_i. The pin wb_clk_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_rst_i. The pin wb_rst_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net arst_i. The pin arst_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_adr_i[2]. The pin wb_adr_i[2] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_adr_i[1]. The pin wb_adr_i[1] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_adr_i[0]. The pin wb_adr_i[0] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[7]. The pin wb_dat_i[7] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[6]. The pin wb_dat_i[6] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[5]. The pin wb_dat_i[5] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[4]. The pin wb_dat_i[4] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[3]. The pin wb_dat_i[3] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[2]. The pin wb_dat_i[2] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[1]. The pin wb_dat_i[1] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_dat_i[0]. The pin wb_dat_i[0] on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_we_i. The pin wb_we_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_stb_i. The pin wb_stb_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net wb_cyc_i. The pin wb_cyc_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net scl_pad_i. The pin scl_pad_i on cell routing does not have enough gate area information. (ZRT-311)
Warning: Skipping antenna analysis for net sda_pad_i. The pin sda_pad_i on cell routing does not have enough gate area information. (ZRT-311)
Skipping antenna analysis for 19 nets as they don't have enough gate area info.

Begin full DRC check ...

Information: Using 1 threads for routing. (ZRT-444)
Checked 1/4 Partitions, Violations =    3
Checked 2/4 Partitions, Violations =    64
Checked 3/4 Partitions, Violations =    91
Checked 4/4 Partitions, Violations =    379
[DRC CHECK] Elapsed real time: 0:00:00 
[DRC CHECK] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DRC CHECK] Stage (MB): Used    0  Alloctr    0  Proc    0 
[DRC CHECK] Total (MB): Used   90  Alloctr   91  Proc 5566 
Start net based rule analysis
Found 0 antenna instance ports
End net based rule analysis
[Antenna analysis] Elapsed real time: 0:00:00 
[Antenna analysis] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Antenna analysis] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Antenna analysis] Total (MB): Used   90  Alloctr   91  Proc 5566 
Information: Merged away 119 aligned/redundant DRCs. (ZRT-305)

DRC-SUMMARY:
        @@@@@@@ TOTAL VIOLATIONS =      260
        Diff net spacing : 99
        Diff net via-cut spacing : 1
        Less than minimum width : 1
        Same net spacing : 5
        Short : 154


Total Wire Length =                    22760 micron
Total Number of Contacts =             6364
Total Number of Wires =                7511
Total Number of PtConns =              457
Total Number of Routed Wires =       7418
Total Routed Wire Length =           22635 micron
Total Number of Routed Contacts =       6364
        Layer          M1 :        662 micron
        Layer          M2 :       9604 micron
        Layer          M3 :       8777 micron
        Layer          M4 :       2227 micron
        Layer          M5 :       1365 micron
        Layer          M6 :          0 micron
        Layer          M7 :          0 micron
        Layer          M8 :          0 micron
        Layer          M9 :          0 micron
        Via        VIA45C :        132
        Via   VIA45C(rot) :          1
        Via   VIA34C(rot) :        433
        Via        VIA23C :       2896
        Via        VIA12C :         11
        Via   VIA12C(rot) :       2365
        Via        VIA12B :         39
        Via   VIA12B(rot) :        487

 
Redundant via conversion report:
--------------------------------

  Total optimized via conversion rate =  0.00% (0 / 6364 vias)
 
    Layer VIA1       =  0.00% (0      / 2902    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2902    vias)
    Layer VIA2       =  0.00% (0      / 2896    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2896    vias)
    Layer VIA3       =  0.00% (0      / 433     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (433     vias)
    Layer VIA4       =  0.00% (0      / 133     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (133     vias)
 
  Total double via conversion rate    =  0.00% (0 / 6364 vias)
 
    Layer VIA1       =  0.00% (0      / 2902    vias)
    Layer VIA2       =  0.00% (0      / 2896    vias)
    Layer VIA3       =  0.00% (0      / 433     vias)
    Layer VIA4       =  0.00% (0      / 133     vias)
 
  The optimized via conversion rate based on total routed via count =  0.00% (0 / 6364 vias)
 
    Layer VIA1       =  0.00% (0      / 2902    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2902    vias)
    Layer VIA2       =  0.00% (0      / 2896    vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (2896    vias)
    Layer VIA3       =  0.00% (0      / 433     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (433     vias)
    Layer VIA4       =  0.00% (0      / 133     vias)
        Un-optimized =  0.00% (0       vias)
        Un-mapped    = 100.00% (133     vias)
 


Verify Summary:

Total number of nets = 881, of which 0 are not extracted
Total number of open nets = 0, of which 0 are frozen
Total number of excluded ports = 0 ports of 0 unplaced cells connected to 0 nets
                                 0 ports without pins of 0 cells connected to 0 nets
                                 0 ports of 0 cover cells connected to 0 non-pg nets
Total number of DRCs = 260
Total number of antenna violations = 0
Total number of tie to rail violations = not checked
Total number of tie to rail directly violations = not checked


icc2_shell> #Routing is Finished
icc2_shell> # 2.Filler Cells Insertion
icc2_shell> set FillerCells " SHFILL128 SHFILL64 SHFILL1 "
 SHFILL128 SHFILL64 SHFILL1 
icc2_shell> create_stdcell_fillers -lib_cells $FillerCells
CHF: Filler insertion auto mode id 0, current filler mode 0, M0M1Routing = 0 
* Disjointed site row process : FALSE
INFO:: begin filler insertions...
CHF::NPL_CHKQUERY_PNET checking turned off by default
master SHFILL128 has site unit
master SHFILL64 has site unit
master SHFILL1 has site unit
 Use site unit (3200)
Warning: filler ref cell SHFILL128 not marked filler type. (CHF-011)
Warning: filler ref cell SHFILL64 not marked filler type. (CHF-011)
Warning: filler ref cell SHFILL1 not marked filler type. (CHF-011)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 906 total shapes.
Layer M2: cached 0 shapes out of 4589 total shapes.
Cached 0 vias out of 6364 total vias.
CHF: loading design...
CHF:: Loading blkInsts from NDM...
CHF:: Building row/inst relations...
INFO:: Use fillers in order(1000): SHFILL128 (128 x 1), SHFILL64 (64 x 1), SHFILL1 (1 x 1), 
Regular Filler Insertion Complete
CHF:: Create all new fillers...
... 0 of regular filler SHFILL128 inserted
... 0 of regular filler SHFILL64 inserted
... 0 of regular filler SHFILL1 inserted
icc2_shell> connect_pg_net -automatic
****************************************
Report : Power/Ground Connection Summary
Design : i2c_master_top
Version: V-2023.12
Date   : Thu May 16 11:36:16 2024
****************************************
P/G net name                   P/G pin count(previous/current)
--------------------------------------------------------------------------------
Power net GVDD                 4141/4141
Ground net GVSS                4141/4141
--------------------------------------------------------------------------------
Information: connections of 0 power/ground pin(s) are created or changed.
1
icc2_shell> remove_stdcell_fillers_with_violation
Information: The command 'remove_stdcell_fillers_with_violation' cleared the undo history. (UNDO-016)
Warning: Cell contains tie connections which are not connected to real PG. (ZRT-511)
Warning: Ignore contact DIFFCON. (ZRT-015)
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = M9
Information: Option route.detail.force_end_on_preferred_grid will be ignored since none of the layers have preferred grid. (ZRT-703)
Warning: Port GVDD of cell routing
        is unplaced.  This may impact routing result. (ZRT-740)
Warning: Port GVSS of cell routing
        is unplaced.  This may impact routing result. (ZRT-740)
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Information: Via ladder engine would be activated for pattern must join connection in certain commands. Please refer to man-page for the command list. (ZRT-619)
Warning: Contact VIA89's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's lower layer enclosure width does not satisfy end of line enclosure design rule. (ZRT-042)
Warning: Contact VIA89C's upper layer enclosure height does not satisfy end of line enclosure design rule. (ZRT-042)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M1 default pitch 0.320 may be too small to handle up/down via. Note, that minimum requirements are "wire/via-down 0.315" & "wire/via-up 0.330". (ZRT-026)
Via on layer (VIA1) needs more than one tracks
Warning: Layer M2 default pitch 0.320 may be too small to handle up/down via. Note, that minimum requirements are "wire/via-down 0.360" & "wire/via-up 0.320". (ZRT-026)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 11.25 outside the layer range. (ZRT-707)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 11.25 outside the layer range on clock nets. (ZRT-718)
Information: When applicable layer based tapering will taper up to 0.00 in distance from the pin. (ZRT-706)
Warning: Cell U74 is placed overlapping with other cells at {{14.160 10.000} {18.320 12.880}}. (ZRT-763)
Warning: Cell byte_controller/U64 is placed overlapping with other cells at {{106.960 18.640} {112.080 21.520}}. (ZRT-763)
Warning: Cell byte_controller/U36 is placed overlapping with other cells at {{62.160 87.760} {66.320 90.640}}. (ZRT-763)
Warning: Cell byte_controller/bit_controller/cmd_ack_reg is placed overlapping with other cells at {{81.360 93.520} {92.560 96.400}}. (ZRT-763)
Printing options for 'route.common.*'
common.eco_route_fix_existing_drc                       :        true                
common.verbose_level                                    :        0                   

Printing options for 'route.detail.*'
detail.antenna                                          :        false               
detail.eco_route_use_soft_spacing_for_timing_optimization:       true                

Printing options for 'route.auto_via_ladder.*'

[Start Removing Filler Cells] Elapsed real time: 0:00:00 
[Start Removing Filler Cells] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Start Removing Filler Cells] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Start Removing Filler Cells] Total (MB): Used   28  Alloctr   29  Proc 5566 

Begin Filler DRC check ...

Information: Using 1 threads for routing. (ZRT-444)
Partition 4, Fillers with Violations = 0
Partition 2, Fillers with Violations = 0
Partition 3, Fillers with Violations = 0
Partition 1, Fillers with Violations = 7
[End Removing Filler Cells] Elapsed real time: 0:00:00 
[End Removing Filler Cells] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End Removing Filler Cells] Stage (MB): Used   51  Alloctr   51  Proc    0 
[End Removing Filler Cells] Total (MB): Used   79  Alloctr   80  Proc 5566 
Updating the database ...
Delete xofiller!SHFILL1!x964000y704800 due to Short violation
Delete xofiller!SHFILL1!x996000y935200 due to Short violation
Delete xofiller!SHFILL1!x999200y935200 due to Short violation
Delete xofiller!SHFILL1!x1028000y992800 due to Diff net spacing violation
Delete xofiller!SHFILL1!x1031200y992800 due to Short violation
Delete xofiller!SHFILL1!x906400y1108000 due to Short violation
Delete xofiller!SHFILL1!x909600y1108000 due to Short violation
Deleted 7 cell instances
Information: The net parasitics of block i2c_master_top are cleared. (TIM-123)
icc2_shell> check_legality

************************

running check_legality

Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 906 total shapes.
Layer M2: cached 0 shapes out of 4589 total shapes.
Cached 0 vias out of 6364 total vias.

check_legality for block design i2c_master_top ... 
Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0300 seconds to build cellmap data
Information: Creating classic rule checker.
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
=====> Processed 44 ref cells (0 fillers) from library
Design has no advanced rules
Checking legality
Checking cell legality:
0%....10%....20%....30%....40%....50%....60%....70%....80%....90%....100%
Sorting rows.
Checking spacing rule legality.
0%....10%....20%....30%....40%....50%....60%....70%....80%....90%....100%
Checking packing rule legality.


****************************************
  Report : Legality
****************************************

VIOLATIONS BY CATEGORY:
   MOVABLE  APP-FIXED USER-FIXED  DESCRIPTION
       510          0          0  Two objects overlap.
         0          0          0  A cell violates a pnet.
         0          0          0  A cell is illegal at a site.
         0          0          0  A cell is not aligned with a site.
         0          0          0  A cell has an illegal orientation.
         0          0          0  A cell spacing rule is violated.
         0          0          0  A layer rule is violated.
         0          0          0  A cell is in the wrong region.
         0          0          0  Two cells violate cts margins.
         0          0          0  Two cells violate coloring.

       510          0          0  TOTAL

TOTAL 510 Violations.

VIOLATIONS BY SUBCATEGORY:
     MOVABLE  APP-FIXED USER-FIXED  DESCRIPTION

       510          0          0    Two objects overlap.
         510          0          0    Two cells overlap.
           0          0          0    Two cells have overlapping keepout margins.
           0          0          0    A cell overlaps a blockage.
           0          0          0    A cell keepout margin overlaps a blockage.

         0          0          0    A cell violates a pnet.

         0          0          0    A cell is illegal at a site.
           0          0          0    A cell violates pin-track alignment rules.
           0          0          0    A cell is illegal at a site.
           0          0          0    A cell violates legal index rule.
           0          0          0    A cell has the wrong variant for its location.

         0          0          0    A cell is not aligned with a site.
           0          0          0    A cell is not aligned with the base site.
           0          0          0    A cell is not aligned with an overlaid site.

         0          0          0    A cell has an illegal orientation.

         0          0          0    A cell spacing rule is violated.
           0          0          0    A spacing rule is violated in a row.
           0          0          0    A spacing rule is violated between adjacent rows.
           0          0          0    A cell violates vertical abutment rule.
           0          0          0    A cell violates metal spacing rule.

         0          0          0    A layer rule is violated.
           0          0          0    A layer VTH rule is violated.
           0          0          0    A layer OD rule is violated.
           0          0          0    A layer OD max-width rule is violated.
           0          0          0    A layer ALL_OD corner rule is violated.
           0          0          0    A layer max-vertical-length rule is violated.
           0          0          0    A layer TPO rule is violated.
           0          0          0    Filler cell insertion cannot satisfy layer rules.

         0          0          0    A cell is in the wrong region.
           0          0          0    A cell is outside its hard bound.
           0          0          0    A cell is in the wrong voltage area.
           0          0          0    A cell violates an exclusive movebound.

         0          0          0    Two cells violate cts margins.

         0          0          0    Two cells violate coloring.


check_legality for block design i2c_master_top failed!

check_legality failed.

**************************

0
icc2_shell> # 3.Checks & Output
icc2_shell> # First Create new directory called output in pnr folder
icc2_shell> set DESIGN_NAME i2c_master_top
i2c_master_top
icc2_shell> # Netlist after physical synthesis
icc2_shell> write_verilog  /eda/synopsys/final_project/pnr/output/${DESIGN_NAME}_for_pt_v.v
1
icc2_shell> #SDC_OUT
icc2_shell> write_sdc -output /eda/synopsys/final_project/pnr/output/${DESIGN_NAME}.out.sdc
Information: The command 'write_sdc' cleared the undo history. (UNDO-016)

Warning: Multiply cell derates are skipped!

Warning: Multiply net derates are skipped!
1
icc2_shell> # SPEF_OUT
icc2_shell> write_parasitics -format SPEF -output /eda/synopsys/final_project/pnr/output/${DESIGN_NAME}.out.spef
Information: Design routing has 879 nets, 0 global routed, 877 detail routed. (NEX-024)
NEX: extract design i2c_master_top
Information: The RC mode used is DR for design 'i2c_master_top'. (NEX-022)
---extraction options---
Corner: default
 late_cap_scale                : 1
 late_res_scale                : 1
 early_cap_scale               : 1
 early_res_scale               : 1
Global options:
 reference_direction       : use_from_tluplus
 real_metalfill_extraction : none
 virtual_shield_extraction : true
---app options---
 host.max_cores                   : 1
 extract.connect_open           : true
 extract.enable_coupling_cap    : false
Extracting design: routing 
Information: coupling capacitance is lumped to ground. (NEX-030)
Information: 877 nets are successfully extracted. (NEX-028)
Information: batch extract takes 0.52 seconds, elapse 0.52 seconds (NEX-015)
Information: The stitching and editing of coupling caps is turned OFF for design 'counter.dlib:routing.design'. (TIM-125)
NEX: write corner ID 0 parasitics to /eda/synopsys/final_project/pnr/output/i2c_master_top.out.spef.minTLU_-40.spef 
spefName /eda/synopsys/final_project/pnr/output/i2c_master_top.out.spef.minTLU_-40.spef, corner name default 
NEX: write corner ID 1 parasitics to /eda/synopsys/final_project/pnr/output/i2c_master_top.out.spef.maxTLU_-40.spef 
spefName /eda/synopsys/final_project/pnr/output/i2c_master_top.out.spef.maxTLU_-40.spef, corner name default 
NEX:Warning write_parasitics supports only Ohm and kOhm as user resistance unit not 1MOhm, we force to set it Ohm.NEX: write_parasitics command finished
icc2_shell> ######DEF_OUT
icc2_shell> write_def /eda/synopsys/final_project/pnr/output/${DESIGN_NAME}.out.def
****************************************
Report : Data Mismatches
Version: V-2023.12
Date   : Thu May 16 11:36:19 2024
****************************************
No mismatches exist on the design.
---------------------------------------
Number of Written DEF Constructs
---------------------------------------
VERSION                        : 1
DIVIDERCHAR                    : 1
BUSBITCHARS                    : 1
DESIGN                         : 1
UNITS                          : 1
PROPERTYDEFINITIONS            : 1
DIEAREA                        : 1
ROW                            : 41
TRACKS                         : 18
NONDEFAULTRULES                : 1
COMPONENTS                     : 4134
PINS                           : 37
PINPROPERTIES                  : 35
SPECIALNETS                    : 258
NETS                           : 878
1
icc2_shell> ##########GDS_OUT
icc2_shell> set GDS_MAP_FILE /eda/synopsys/project/standardCell/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Technology_Kit/milkyway/saed90nm.gdsout.map
/eda/synopsys/project/standardCell/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Technology_Kit/milkyway/saed90nm.gdsout.map
icc2_shell> set STD_CELL_GDS /eda/synopsys/project/standardCell/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Digital_Standard_cell_Library/layout/gds/saed90nm.gds
/eda/synopsys/project/standardCell/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Digital_Standard_cell_Library/layout/gds/saed90nm.gds
icc2_shell> write_gds -view design -lib_cell_view frame -output_pin all -fill include -exclude_empty_block -long_names -layer_map "$GDS_MAP_FILE" -keep_data_type -merge_files "$STD_CELL_GDS" ./output/${DESIGN_NAME}.gds
1
icc2_shell> save_block
Information: The command 'save_block' cleared the undo history. (UNDO-016)
Information: Saving block 'counter.dlib:routing.design'
1
icc2_shell> set_working_design_stack counter.dlib:placement.design
icc2_shell> set_working_design_stack counter.dlib:routing.design
icc2_shell> 